tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_CCM.h
/*
** ###################################################################
**     Processors:          MIMXRT1181CVP2B
**                          MIMXRT1181CVP2C
**                          MIMXRT1181XVP2B
**                          MIMXRT1181XVP2C
**                          MIMXRT1182CVP2B
**                          MIMXRT1182CVP2C
**                          MIMXRT1182XVP2B
**                          MIMXRT1182XVP2C
**                          MIMXRT1186CVJ8C_cm33
**                          MIMXRT1186CVJ8C_cm7
**                          MIMXRT1186XVJ8C_cm33
**                          MIMXRT1186XVJ8C_cm7
**                          MIMXRT1187AVM8B_cm33
**                          MIMXRT1187AVM8B_cm7
**                          MIMXRT1187AVM8C_cm33
**                          MIMXRT1187AVM8C_cm7
**                          MIMXRT1187CVM8B_cm33
**                          MIMXRT1187CVM8B_cm7
**                          MIMXRT1187CVM8C_cm33
**                          MIMXRT1187CVM8C_cm7
**                          MIMXRT1187XVM8B_cm33
**                          MIMXRT1187XVM8B_cm7
**                          MIMXRT1187XVM8C_cm33
**                          MIMXRT1187XVM8C_cm7
**                          MIMXRT1189CVM8B_cm33
**                          MIMXRT1189CVM8B_cm7
**                          MIMXRT1189CVM8C_cm33
**                          MIMXRT1189CVM8C_cm7
**                          MIMXRT1189XVM8B_cm33
**                          MIMXRT1189XVM8B_cm7
**                          MIMXRT1189XVM8C_cm33
**                          MIMXRT1189XVM8C_cm7
**
**     Version:             rev. 3.0, 2024-10-29
**     Build:               b250721
**
**     Abstract:
**         CMSIS Peripheral Access Layer for CCM
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2021-03-09)
**         Initial version.
**     - rev. 2.0 (2024-01-18)
**         Header RFP.
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_CCM.h
 * @version 3.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for CCM
 *
 * CMSIS Peripheral Access Layer for CCM
 */

#if !defined(PERI_CCM_H_)
#define PERI_CCM_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT1181CVP2B) || defined(CPU_MIMXRT1181CVP2C) || defined(CPU_MIMXRT1181XVP2B) || defined(CPU_MIMXRT1181XVP2C))
#include "MIMXRT1181_COMMON.h"
#elif (defined(CPU_MIMXRT1182CVP2B) || defined(CPU_MIMXRT1182CVP2C) || defined(CPU_MIMXRT1182XVP2B) || defined(CPU_MIMXRT1182XVP2C))
#include "MIMXRT1182_COMMON.h"
#elif (defined(CPU_MIMXRT1186CVJ8C_cm33) || defined(CPU_MIMXRT1186XVJ8C_cm33))
#include "MIMXRT1186_cm33_COMMON.h"
#elif (defined(CPU_MIMXRT1186CVJ8C_cm7) || defined(CPU_MIMXRT1186XVJ8C_cm7))
#include "MIMXRT1186_cm7_COMMON.h"
#elif (defined(CPU_MIMXRT1187AVM8B_cm33) || defined(CPU_MIMXRT1187AVM8C_cm33) || defined(CPU_MIMXRT1187CVM8B_cm33) || defined(CPU_MIMXRT1187CVM8C_cm33) || defined(CPU_MIMXRT1187XVM8B_cm33) || defined(CPU_MIMXRT1187XVM8C_cm33))
#include "MIMXRT1187_cm33_COMMON.h"
#elif (defined(CPU_MIMXRT1187AVM8B_cm7) || defined(CPU_MIMXRT1187AVM8C_cm7) || defined(CPU_MIMXRT1187CVM8B_cm7) || defined(CPU_MIMXRT1187CVM8C_cm7) || defined(CPU_MIMXRT1187XVM8B_cm7) || defined(CPU_MIMXRT1187XVM8C_cm7))
#include "MIMXRT1187_cm7_COMMON.h"
#elif (defined(CPU_MIMXRT1189CVM8B_cm33) || defined(CPU_MIMXRT1189CVM8C_cm33) || defined(CPU_MIMXRT1189XVM8B_cm33) || defined(CPU_MIMXRT1189XVM8C_cm33))
#include "MIMXRT1189_cm33_COMMON.h"
#elif (defined(CPU_MIMXRT1189CVM8B_cm7) || defined(CPU_MIMXRT1189CVM8C_cm7) || defined(CPU_MIMXRT1189XVM8B_cm7) || defined(CPU_MIMXRT1189XVM8C_cm7))
#include "MIMXRT1189_cm7_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- CCM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CCM_Peripheral_Access_Layer CCM Peripheral Access Layer
 * @{
 */

/** CCM - Size of Registers Arrays */
#define CCM_CLOCK_ROOT_COUNT                      74u
#define CCM_OBSERVE_COUNT                         2u
#define CCM_GPR_SHARED_STATUS_COUNT               8u
#define CCM_GPR_PRIVATE_COUNT                     4u
#define CCM_OSCPLL_COUNT                          25u
#define CCM_LPCG_COUNT                            149u

/** CCM - Register Layout Typedef */
typedef struct {
  struct {                                         /* offset: 0x0, array step: 0x80 */
    __IO uint32_t CONTROL;                           /**< Clock Root Control Register, array offset: 0x0, array step: 0x80 */
    __IO uint32_t CONTROL_SET;                       /**< Clock Root Control Register, array offset: 0x4, array step: 0x80 */
    __IO uint32_t CONTROL_CLR;                       /**< Clock Root Control Register, array offset: 0x8, array step: 0x80 */
    __IO uint32_t CONTROL_TOG;                       /**< Clock Root Control Register, array offset: 0xC, array step: 0x80 */
         uint8_t RESERVED_0[16];
    __I  uint32_t STATUS0;                           /**< Clock root working status, array offset: 0x20, array step: 0x80 */
         uint8_t RESERVED_1[12];
    __IO uint32_t AUTHEN;                            /**< Clock root access control, array offset: 0x30, array step: 0x80 */
         uint8_t RESERVED_2[76];
  } CLOCK_ROOT[CCM_CLOCK_ROOT_COUNT];
       uint8_t RESERVED_0[7936];
  struct {                                         /* offset: 0x4400, array step: 0x80 */
    __IO uint32_t CONTROL;                           /**< Observe control, array offset: 0x4400, array step: 0x80 */
    __IO uint32_t CONTROL_SET;                       /**< Observe control, array offset: 0x4404, array step: 0x80 */
    __IO uint32_t CONTROL_CLR;                       /**< Observe control, array offset: 0x4408, array step: 0x80 */
    __IO uint32_t CONTROL_TOG;                       /**< Observe control, array offset: 0x440C, array step: 0x80 */
         uint8_t RESERVED_0[16];
    __I  uint32_t STATUS;                            /**< Observe status, array offset: 0x4420, array step: 0x80 */
         uint8_t RESERVED_1[12];
    __IO uint32_t AUTHEN;                            /**< Observe access control, array offset: 0x4430, array step: 0x80 */
    __IO uint32_t AUTHEN_SET;                        /**< Observe access control, array offset: 0x4434, array step: 0x80 */
    __IO uint32_t AUTHEN_CLR;                        /**< Observe access control, array offset: 0x4438, array step: 0x80 */
    __IO uint32_t AUTHEN_TOG;                        /**< Observe access control, array offset: 0x443C, array step: 0x80 */
    __I  uint32_t FREQUENCY_CURRENT;                 /**< Current frequency detected, array offset: 0x4440, array step: 0x80 */
    __I  uint32_t FREQUENCY_MIN;                     /**< Minimum frequency detected, array offset: 0x4444, array step: 0x80 */
    __I  uint32_t FREQUENCY_MAX;                     /**< Maximum frequency detected, array offset: 0x4448, array step: 0x80 */
         uint8_t RESERVED_2[4];
    __I  uint32_t PERIOD_CURRENT;                    /**< Current period time detected, array offset: 0x4450, array step: 0x80 */
    __I  uint32_t PERIOD_MIN;                        /**< Minimum period time detected, array offset: 0x4454, array step: 0x80 */
    __I  uint32_t PERIOD_MAX;                        /**< Maximum period time detected, array offset: 0x4458, array step: 0x80 */
         uint8_t RESERVED_3[4];
    __I  uint32_t HIGH_CURRENT;                      /**< Current high level time detected, array offset: 0x4460, array step: 0x80 */
    __I  uint32_t HIGH_MIN;                          /**< Minimum high level time detected, array offset: 0x4464, array step: 0x80 */
    __I  uint32_t HIGH_MAX;                          /**< Maximum high level time detected, array offset: 0x4468, array step: 0x80 */
         uint8_t RESERVED_4[4];
    __I  uint32_t LOW_CURRENT;                       /**< Current high level time detected, array offset: 0x4470, array step: 0x80 */
    __I  uint32_t LOW_MIN;                           /**< Minimum high level time detected, array offset: 0x4474, array step: 0x80 */
    __I  uint32_t LOW_MAX;                           /**< Maximum high level time detected, array offset: 0x4478, array step: 0x80 */
         uint8_t RESERVED_5[4];
  } OBSERVE[CCM_OBSERVE_COUNT];
       uint8_t RESERVED_1[768];
       uint32_t GPR_SHARED0;                       /**< General Purpose Register, offset: 0x4800 */
       uint32_t GPR_SHARED0_SET;                   /**< General Purpose Register, offset: 0x4804 */
       uint32_t GPR_SHARED0_CLR;                   /**< General Purpose Register, offset: 0x4808 */
       uint32_t GPR_SHARED0_TOG;                   /**< General Purpose Register, offset: 0x480C */
  __IO uint32_t GPR_SHARED0_AUTHEN;                /**< GPR access control, offset: 0x4810 */
  __IO uint32_t GPR_SHARED0_AUTHEN_SET;            /**< GPR access control, offset: 0x4814 */
  __IO uint32_t GPR_SHARED0_AUTHEN_CLR;            /**< GPR access control, offset: 0x4818 */
  __IO uint32_t GPR_SHARED0_AUTHEN_TOG;            /**< GPR access control, offset: 0x481C */
       uint32_t GPR_SHARED1;                       /**< General Purpose Register, offset: 0x4820 */
       uint32_t GPR_SHARED1_SET;                   /**< General Purpose Register, offset: 0x4824 */
       uint32_t GPR_SHARED1_CLR;                   /**< General Purpose Register, offset: 0x4828 */
       uint32_t GPR_SHARED1_TOG;                   /**< General Purpose Register, offset: 0x482C */
  __IO uint32_t GPR_SHARED1_AUTHEN;                /**< GPR access control, offset: 0x4830 */
  __IO uint32_t GPR_SHARED1_AUTHEN_SET;            /**< GPR access control, offset: 0x4834 */
  __IO uint32_t GPR_SHARED1_AUTHEN_CLR;            /**< GPR access control, offset: 0x4838 */
  __IO uint32_t GPR_SHARED1_AUTHEN_TOG;            /**< GPR access control, offset: 0x483C */
  __IO uint32_t GPR_SHARED2;                       /**< General Purpose Register, offset: 0x4840 */
  __IO uint32_t GPR_SHARED2_SET;                   /**< General Purpose Register, offset: 0x4844 */
  __IO uint32_t GPR_SHARED2_CLR;                   /**< General Purpose Register, offset: 0x4848 */
  __IO uint32_t GPR_SHARED2_TOG;                   /**< General Purpose Register, offset: 0x484C */
  __IO uint32_t GPR_SHARED2_AUTHEN;                /**< GPR access control, offset: 0x4850 */
  __IO uint32_t GPR_SHARED2_AUTHEN_SET;            /**< GPR access control, offset: 0x4854 */
  __IO uint32_t GPR_SHARED2_AUTHEN_CLR;            /**< GPR access control, offset: 0x4858 */
  __IO uint32_t GPR_SHARED2_AUTHEN_TOG;            /**< GPR access control, offset: 0x485C */
  __IO uint32_t GPR_SHARED3;                       /**< General Purpose Register, offset: 0x4860 */
  __IO uint32_t GPR_SHARED3_SET;                   /**< General Purpose Register, offset: 0x4864 */
  __IO uint32_t GPR_SHARED3_CLR;                   /**< General Purpose Register, offset: 0x4868 */
  __IO uint32_t GPR_SHARED3_TOG;                   /**< General Purpose Register, offset: 0x486C */
  __IO uint32_t GPR_SHARED3_AUTHEN;                /**< GPR access control, offset: 0x4870 */
  __IO uint32_t GPR_SHARED3_AUTHEN_SET;            /**< GPR access control, offset: 0x4874 */
  __IO uint32_t GPR_SHARED3_AUTHEN_CLR;            /**< GPR access control, offset: 0x4878 */
  __IO uint32_t GPR_SHARED3_AUTHEN_TOG;            /**< GPR access control, offset: 0x487C */
  __IO uint32_t GPR_SHARED4;                       /**< General Purpose Register, offset: 0x4880 */
  __IO uint32_t GPR_SHARED4_SET;                   /**< General Purpose Register, offset: 0x4884 */
  __IO uint32_t GPR_SHARED4_CLR;                   /**< General Purpose Register, offset: 0x4888 */
  __IO uint32_t GPR_SHARED4_TOG;                   /**< General Purpose Register, offset: 0x488C */
  __IO uint32_t GPR_SHARED4_AUTHEN;                /**< GPR access control, offset: 0x4890 */
  __IO uint32_t GPR_SHARED4_AUTHEN_SET;            /**< GPR access control, offset: 0x4894 */
  __IO uint32_t GPR_SHARED4_AUTHEN_CLR;            /**< GPR access control, offset: 0x4898 */
  __IO uint32_t GPR_SHARED4_AUTHEN_TOG;            /**< GPR access control, offset: 0x489C */
  __IO uint32_t GPR_SHARED5;                       /**< General Purpose Register, offset: 0x48A0 */
  __IO uint32_t GPR_SHARED5_SET;                   /**< General Purpose Register, offset: 0x48A4 */
  __IO uint32_t GPR_SHARED5_CLR;                   /**< General Purpose Register, offset: 0x48A8 */
  __IO uint32_t GPR_SHARED5_TOG;                   /**< General Purpose Register, offset: 0x48AC */
  __IO uint32_t GPR_SHARED5_AUTHEN;                /**< GPR access control, offset: 0x48B0 */
  __IO uint32_t GPR_SHARED5_AUTHEN_SET;            /**< GPR access control, offset: 0x48B4 */
  __IO uint32_t GPR_SHARED5_AUTHEN_CLR;            /**< GPR access control, offset: 0x48B8 */
  __IO uint32_t GPR_SHARED5_AUTHEN_TOG;            /**< GPR access control, offset: 0x48BC */
  __IO uint32_t GPR_SHARED6;                       /**< General Purpose Register, offset: 0x48C0 */
  __IO uint32_t GPR_SHARED6_SET;                   /**< General Purpose Register, offset: 0x48C4 */
  __IO uint32_t GPR_SHARED6_CLR;                   /**< General Purpose Register, offset: 0x48C8 */
  __IO uint32_t GPR_SHARED6_TOG;                   /**< General Purpose Register, offset: 0x48CC */
  __IO uint32_t GPR_SHARED6_AUTHEN;                /**< GPR access control, offset: 0x48D0 */
  __IO uint32_t GPR_SHARED6_AUTHEN_SET;            /**< GPR access control, offset: 0x48D4 */
  __IO uint32_t GPR_SHARED6_AUTHEN_CLR;            /**< GPR access control, offset: 0x48D8 */
  __IO uint32_t GPR_SHARED6_AUTHEN_TOG;            /**< GPR access control, offset: 0x48DC */
  __IO uint32_t GPR_SHARED7;                       /**< General Purpose Register, offset: 0x48E0 */
  __IO uint32_t GPR_SHARED7_SET;                   /**< General Purpose Register, offset: 0x48E4 */
  __IO uint32_t GPR_SHARED7_CLR;                   /**< General Purpose Register, offset: 0x48E8 */
  __IO uint32_t GPR_SHARED7_TOG;                   /**< General Purpose Register, offset: 0x48EC */
  __IO uint32_t GPR_SHARED7_AUTHEN;                /**< GPR access control, offset: 0x48F0 */
  __IO uint32_t GPR_SHARED7_AUTHEN_SET;            /**< GPR access control, offset: 0x48F4 */
  __IO uint32_t GPR_SHARED7_AUTHEN_CLR;            /**< GPR access control, offset: 0x48F8 */
  __IO uint32_t GPR_SHARED7_AUTHEN_TOG;            /**< GPR access control, offset: 0x48FC */
  __IO uint32_t GPR_SHARED8;                       /**< General Purpose Register, offset: 0x4900 */
  __IO uint32_t GPR_SHARED8_SET;                   /**< General Purpose Register, offset: 0x4904 */
  __IO uint32_t GPR_SHARED8_CLR;                   /**< General Purpose Register, offset: 0x4908 */
  __IO uint32_t GPR_SHARED8_TOG;                   /**< General Purpose Register, offset: 0x490C */
  __IO uint32_t GPR_SHARED8_AUTHEN;                /**< GPR access control, offset: 0x4910 */
  __IO uint32_t GPR_SHARED8_AUTHEN_SET;            /**< GPR access control, offset: 0x4914 */
  __IO uint32_t GPR_SHARED8_AUTHEN_CLR;            /**< GPR access control, offset: 0x4918 */
  __IO uint32_t GPR_SHARED8_AUTHEN_TOG;            /**< GPR access control, offset: 0x491C */
  __IO uint32_t GPR_SHARED9;                       /**< General Purpose Register, offset: 0x4920 */
  __IO uint32_t GPR_SHARED9_SET;                   /**< General Purpose Register, offset: 0x4924 */
  __IO uint32_t GPR_SHARED9_CLR;                   /**< General Purpose Register, offset: 0x4928 */
  __IO uint32_t GPR_SHARED9_TOG;                   /**< General Purpose Register, offset: 0x492C */
  __IO uint32_t GPR_SHARED9_AUTHEN;                /**< GPR access control, offset: 0x4930 */
  __IO uint32_t GPR_SHARED9_AUTHEN_SET;            /**< GPR access control, offset: 0x4934 */
  __IO uint32_t GPR_SHARED9_AUTHEN_CLR;            /**< GPR access control, offset: 0x4938 */
  __IO uint32_t GPR_SHARED9_AUTHEN_TOG;            /**< GPR access control, offset: 0x493C */
  __IO uint32_t GPR_SHARED10;                      /**< General Purpose Register, offset: 0x4940 */
  __IO uint32_t GPR_SHARED10_SET;                  /**< General Purpose Register, offset: 0x4944 */
  __IO uint32_t GPR_SHARED10_CLR;                  /**< General Purpose Register, offset: 0x4948 */
  __IO uint32_t GPR_SHARED10_TOG;                  /**< General Purpose Register, offset: 0x494C */
  __IO uint32_t GPR_SHARED10_AUTHEN;               /**< GPR access control, offset: 0x4950 */
  __IO uint32_t GPR_SHARED10_AUTHEN_SET;           /**< GPR access control, offset: 0x4954 */
  __IO uint32_t GPR_SHARED10_AUTHEN_CLR;           /**< GPR access control, offset: 0x4958 */
  __IO uint32_t GPR_SHARED10_AUTHEN_TOG;           /**< GPR access control, offset: 0x495C */
  __IO uint32_t GPR_SHARED11;                      /**< General Purpose Register, offset: 0x4960 */
  __IO uint32_t GPR_SHARED11_SET;                  /**< General Purpose Register, offset: 0x4964 */
  __IO uint32_t GPR_SHARED11_CLR;                  /**< General Purpose Register, offset: 0x4968 */
  __IO uint32_t GPR_SHARED11_TOG;                  /**< General Purpose Register, offset: 0x496C */
  __IO uint32_t GPR_SHARED11_AUTHEN;               /**< GPR access control, offset: 0x4970 */
  __IO uint32_t GPR_SHARED11_AUTHEN_SET;           /**< GPR access control, offset: 0x4974 */
  __IO uint32_t GPR_SHARED11_AUTHEN_CLR;           /**< GPR access control, offset: 0x4978 */
  __IO uint32_t GPR_SHARED11_AUTHEN_TOG;           /**< GPR access control, offset: 0x497C */
  __IO uint32_t GPR_SHARED12;                      /**< General Purpose Register, offset: 0x4980 */
  __IO uint32_t GPR_SHARED12_SET;                  /**< General Purpose Register, offset: 0x4984 */
  __IO uint32_t GPR_SHARED12_CLR;                  /**< General Purpose Register, offset: 0x4988 */
  __IO uint32_t GPR_SHARED12_TOG;                  /**< General Purpose Register, offset: 0x498C */
  __IO uint32_t GPR_SHARED12_AUTHEN;               /**< GPR access control, offset: 0x4990 */
  __IO uint32_t GPR_SHARED12_AUTHEN_SET;           /**< GPR access control, offset: 0x4994 */
  __IO uint32_t GPR_SHARED12_AUTHEN_CLR;           /**< GPR access control, offset: 0x4998 */
  __IO uint32_t GPR_SHARED12_AUTHEN_TOG;           /**< GPR access control, offset: 0x499C */
  __IO uint32_t GPR_SHARED13;                      /**< General Purpose Register, offset: 0x49A0 */
  __IO uint32_t GPR_SHARED13_SET;                  /**< General Purpose Register, offset: 0x49A4 */
  __IO uint32_t GPR_SHARED13_CLR;                  /**< General Purpose Register, offset: 0x49A8 */
  __IO uint32_t GPR_SHARED13_TOG;                  /**< General Purpose Register, offset: 0x49AC */
  __IO uint32_t GPR_SHARED13_AUTHEN;               /**< GPR access control, offset: 0x49B0 */
  __IO uint32_t GPR_SHARED13_AUTHEN_SET;           /**< GPR access control, offset: 0x49B4 */
  __IO uint32_t GPR_SHARED13_AUTHEN_CLR;           /**< GPR access control, offset: 0x49B8 */
  __IO uint32_t GPR_SHARED13_AUTHEN_TOG;           /**< GPR access control, offset: 0x49BC */
  __IO uint32_t GPR_SHARED14;                      /**< General Purpose Register, offset: 0x49C0 */
  __IO uint32_t GPR_SHARED14_SET;                  /**< General Purpose Register, offset: 0x49C4 */
  __IO uint32_t GPR_SHARED14_CLR;                  /**< General Purpose Register, offset: 0x49C8 */
  __IO uint32_t GPR_SHARED14_TOG;                  /**< General Purpose Register, offset: 0x49CC */
  __IO uint32_t GPR_SHARED14_AUTHEN;               /**< GPR access control, offset: 0x49D0 */
  __IO uint32_t GPR_SHARED14_AUTHEN_SET;           /**< GPR access control, offset: 0x49D4 */
  __IO uint32_t GPR_SHARED14_AUTHEN_CLR;           /**< GPR access control, offset: 0x49D8 */
  __IO uint32_t GPR_SHARED14_AUTHEN_TOG;           /**< GPR access control, offset: 0x49DC */
  __IO uint32_t GPR_SHARED15;                      /**< General Purpose Register, offset: 0x49E0 */
  __IO uint32_t GPR_SHARED15_SET;                  /**< General Purpose Register, offset: 0x49E4 */
  __IO uint32_t GPR_SHARED15_CLR;                  /**< General Purpose Register, offset: 0x49E8 */
  __IO uint32_t GPR_SHARED15_TOG;                  /**< General Purpose Register, offset: 0x49EC */
  __IO uint32_t GPR_SHARED15_AUTHEN;               /**< GPR access control, offset: 0x49F0 */
  __IO uint32_t GPR_SHARED15_AUTHEN_SET;           /**< GPR access control, offset: 0x49F4 */
  __IO uint32_t GPR_SHARED15_AUTHEN_CLR;           /**< GPR access control, offset: 0x49F8 */
  __IO uint32_t GPR_SHARED15_AUTHEN_TOG;           /**< GPR access control, offset: 0x49FC */
  __I  uint32_t GPR_SHARED_STATUS[CCM_GPR_SHARED_STATUS_COUNT]; /**< General purpose status register for CM33..General purpose status register for CM7, array offset: 0x4A00, array step: 0x4 */
       uint8_t RESERVED_2[480];
  struct {                                         /* offset: 0x4C00, array step: 0x20 */
    __IO uint32_t GPR_PRIVATE;                       /**< General purpose register, array offset: 0x4C00, array step: 0x20 */
    __IO uint32_t SET;                               /**< General purpose register, array offset: 0x4C04, array step: 0x20 */
    __IO uint32_t CLR;                               /**< General purpose register, array offset: 0x4C08, array step: 0x20 */
    __IO uint32_t TOG;                               /**< General purpose register, array offset: 0x4C0C, array step: 0x20 */
    __IO uint32_t AUTHEN;                            /**< GPR access control, array offset: 0x4C10, array step: 0x20 */
    __IO uint32_t AUTHEN_SET;                        /**< GPR access control, array offset: 0x4C14, array step: 0x20 */
    __IO uint32_t AUTHEN_CLR;                        /**< GPR access control, array offset: 0x4C18, array step: 0x20 */
    __IO uint32_t AUTHEN_TOG;                        /**< GPR access control, array offset: 0x4C1C, array step: 0x20 */
  } GPR_PRIVATE[CCM_GPR_PRIVATE_COUNT];
       uint8_t RESERVED_3[896];
  struct {                                         /* offset: 0x5000, array step: 0x40 */
    __IO uint32_t DIRECT;                            /**< Clock source direct control, array offset: 0x5000, array step: 0x40 */
         uint8_t RESERVED_0[12];
