tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_CCM.h
#define CCM_OBSERVE_CONTROL_SELECT_MASK          (0x1FFU)
#define CCM_OBSERVE_CONTROL_SELECT_SHIFT         (0U)
/*! SELECT - Observe signal selector */
#define CCM_OBSERVE_CONTROL_SELECT(x)            (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_SELECT_SHIFT)) & CCM_OBSERVE_CONTROL_SELECT_MASK)

#define CCM_OBSERVE_CONTROL_RAW_MASK             (0x1000U)
#define CCM_OBSERVE_CONTROL_RAW_SHIFT            (12U)
/*! RAW - Observe raw signal
 *  0b0..Select divided signal.
 *  0b1..Select raw signal.
 */
#define CCM_OBSERVE_CONTROL_RAW(x)               (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_RAW_SHIFT)) & CCM_OBSERVE_CONTROL_RAW_MASK)

#define CCM_OBSERVE_CONTROL_INV_MASK             (0x2000U)
#define CCM_OBSERVE_CONTROL_INV_SHIFT            (13U)
/*! INV
 *  0b0..Clock phase remain same.
 *  0b1..Invert clock phase before measurement or send to IO.
 */
#define CCM_OBSERVE_CONTROL_INV(x)               (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_INV_SHIFT)) & CCM_OBSERVE_CONTROL_INV_MASK)

#define CCM_OBSERVE_CONTROL_RESET_MASK           (0x8000U)
#define CCM_OBSERVE_CONTROL_RESET_SHIFT          (15U)
/*! RESET - Reset observe divider
 *  0b0..Reset deasserts
 *  0b1..Reset asserts
 */
#define CCM_OBSERVE_CONTROL_RESET(x)             (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_RESET_SHIFT)) & CCM_OBSERVE_CONTROL_RESET_MASK)

#define CCM_OBSERVE_CONTROL_DIVIDE_MASK          (0xFF0000U)
#define CCM_OBSERVE_CONTROL_DIVIDE_SHIFT         (16U)
/*! DIVIDE - Division factor of the divider for observed signal */
#define CCM_OBSERVE_CONTROL_DIVIDE(x)            (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_DIVIDE_SHIFT)) & CCM_OBSERVE_CONTROL_DIVIDE_MASK)

#define CCM_OBSERVE_CONTROL_OFF_MASK             (0x1000000U)
#define CCM_OBSERVE_CONTROL_OFF_SHIFT            (24U)
/*! OFF - Turn off
 *  0b0..observe slice is on
 *  0b1..observe slice is off
 */
#define CCM_OBSERVE_CONTROL_OFF(x)               (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_OFF_SHIFT)) & CCM_OBSERVE_CONTROL_OFF_MASK)
/*! @} */

/* The count of CCM_OBSERVE_CONTROL */
#define CCM_OBSERVE_CONTROL_COUNT                (2U)

/*! @name OBSERVE_CONTROL_SET - Observe control */
/*! @{ */

#define CCM_OBSERVE_CONTROL_SET_SELECT_MASK      (0x1FFU)
#define CCM_OBSERVE_CONTROL_SET_SELECT_SHIFT     (0U)
/*! SELECT - Observe signal selector */
#define CCM_OBSERVE_CONTROL_SET_SELECT(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_SET_SELECT_SHIFT)) & CCM_OBSERVE_CONTROL_SET_SELECT_MASK)

#define CCM_OBSERVE_CONTROL_SET_RAW_MASK         (0x1000U)
#define CCM_OBSERVE_CONTROL_SET_RAW_SHIFT        (12U)
/*! RAW - Observe raw signal */
#define CCM_OBSERVE_CONTROL_SET_RAW(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_SET_RAW_SHIFT)) & CCM_OBSERVE_CONTROL_SET_RAW_MASK)

#define CCM_OBSERVE_CONTROL_SET_INV_MASK         (0x2000U)
#define CCM_OBSERVE_CONTROL_SET_INV_SHIFT        (13U)
#define CCM_OBSERVE_CONTROL_SET_INV(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_SET_INV_SHIFT)) & CCM_OBSERVE_CONTROL_SET_INV_MASK)

#define CCM_OBSERVE_CONTROL_SET_RESET_MASK       (0x8000U)
#define CCM_OBSERVE_CONTROL_SET_RESET_SHIFT      (15U)
/*! RESET - Reset observe divider */
#define CCM_OBSERVE_CONTROL_SET_RESET(x)         (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_SET_RESET_SHIFT)) & CCM_OBSERVE_CONTROL_SET_RESET_MASK)

#define CCM_OBSERVE_CONTROL_SET_DIVIDE_MASK      (0xFF0000U)
#define CCM_OBSERVE_CONTROL_SET_DIVIDE_SHIFT     (16U)
/*! DIVIDE - Division factor of the divider for observed signal */
#define CCM_OBSERVE_CONTROL_SET_DIVIDE(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_SET_DIVIDE_SHIFT)) & CCM_OBSERVE_CONTROL_SET_DIVIDE_MASK)

#define CCM_OBSERVE_CONTROL_SET_OFF_MASK         (0x1000000U)
#define CCM_OBSERVE_CONTROL_SET_OFF_SHIFT        (24U)
/*! OFF - Turn off */
#define CCM_OBSERVE_CONTROL_SET_OFF(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_SET_OFF_SHIFT)) & CCM_OBSERVE_CONTROL_SET_OFF_MASK)
/*! @} */

/* The count of CCM_OBSERVE_CONTROL_SET */
#define CCM_OBSERVE_CONTROL_SET_COUNT            (2U)

/*! @name OBSERVE_CONTROL_CLR - Observe control */
/*! @{ */

#define CCM_OBSERVE_CONTROL_CLR_SELECT_MASK      (0x1FFU)
#define CCM_OBSERVE_CONTROL_CLR_SELECT_SHIFT     (0U)
/*! SELECT - Observe signal selector */
#define CCM_OBSERVE_CONTROL_CLR_SELECT(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_CLR_SELECT_SHIFT)) & CCM_OBSERVE_CONTROL_CLR_SELECT_MASK)

#define CCM_OBSERVE_CONTROL_CLR_RAW_MASK         (0x1000U)
#define CCM_OBSERVE_CONTROL_CLR_RAW_SHIFT        (12U)
/*! RAW - Observe raw signal */
#define CCM_OBSERVE_CONTROL_CLR_RAW(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_CLR_RAW_SHIFT)) & CCM_OBSERVE_CONTROL_CLR_RAW_MASK)

#define CCM_OBSERVE_CONTROL_CLR_INV_MASK         (0x2000U)
#define CCM_OBSERVE_CONTROL_CLR_INV_SHIFT        (13U)
#define CCM_OBSERVE_CONTROL_CLR_INV(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_CLR_INV_SHIFT)) & CCM_OBSERVE_CONTROL_CLR_INV_MASK)

#define CCM_OBSERVE_CONTROL_CLR_RESET_MASK       (0x8000U)
#define CCM_OBSERVE_CONTROL_CLR_RESET_SHIFT      (15U)
/*! RESET - Reset observe divider */
#define CCM_OBSERVE_CONTROL_CLR_RESET(x)         (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_CLR_RESET_SHIFT)) & CCM_OBSERVE_CONTROL_CLR_RESET_MASK)

#define CCM_OBSERVE_CONTROL_CLR_DIVIDE_MASK      (0xFF0000U)
#define CCM_OBSERVE_CONTROL_CLR_DIVIDE_SHIFT     (16U)
/*! DIVIDE - Division factor of the divider for observed signal */
#define CCM_OBSERVE_CONTROL_CLR_DIVIDE(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_CLR_DIVIDE_SHIFT)) & CCM_OBSERVE_CONTROL_CLR_DIVIDE_MASK)

#define CCM_OBSERVE_CONTROL_CLR_OFF_MASK         (0x1000000U)
#define CCM_OBSERVE_CONTROL_CLR_OFF_SHIFT        (24U)
/*! OFF - Turn off */
#define CCM_OBSERVE_CONTROL_CLR_OFF(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_CLR_OFF_SHIFT)) & CCM_OBSERVE_CONTROL_CLR_OFF_MASK)
/*! @} */

/* The count of CCM_OBSERVE_CONTROL_CLR */
#define CCM_OBSERVE_CONTROL_CLR_COUNT            (2U)

