tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_CCM.h
/*! @name OBSERVE_CONTROL_TOG - Observe control */
/*! @{ */

#define CCM_OBSERVE_CONTROL_TOG_SELECT_MASK      (0x1FFU)
#define CCM_OBSERVE_CONTROL_TOG_SELECT_SHIFT     (0U)
/*! SELECT - Observe signal selector */
#define CCM_OBSERVE_CONTROL_TOG_SELECT(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_TOG_SELECT_SHIFT)) & CCM_OBSERVE_CONTROL_TOG_SELECT_MASK)

#define CCM_OBSERVE_CONTROL_TOG_RAW_MASK         (0x1000U)
#define CCM_OBSERVE_CONTROL_TOG_RAW_SHIFT        (12U)
/*! RAW - Observe raw signal */
#define CCM_OBSERVE_CONTROL_TOG_RAW(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_TOG_RAW_SHIFT)) & CCM_OBSERVE_CONTROL_TOG_RAW_MASK)

#define CCM_OBSERVE_CONTROL_TOG_INV_MASK         (0x2000U)
#define CCM_OBSERVE_CONTROL_TOG_INV_SHIFT        (13U)
#define CCM_OBSERVE_CONTROL_TOG_INV(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_TOG_INV_SHIFT)) & CCM_OBSERVE_CONTROL_TOG_INV_MASK)

#define CCM_OBSERVE_CONTROL_TOG_RESET_MASK       (0x8000U)
#define CCM_OBSERVE_CONTROL_TOG_RESET_SHIFT      (15U)
/*! RESET - Reset observe divider */
#define CCM_OBSERVE_CONTROL_TOG_RESET(x)         (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_TOG_RESET_SHIFT)) & CCM_OBSERVE_CONTROL_TOG_RESET_MASK)

#define CCM_OBSERVE_CONTROL_TOG_DIVIDE_MASK      (0xFF0000U)
#define CCM_OBSERVE_CONTROL_TOG_DIVIDE_SHIFT     (16U)
/*! DIVIDE - Division factor of the divider for observed signal */
#define CCM_OBSERVE_CONTROL_TOG_DIVIDE(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_TOG_DIVIDE_SHIFT)) & CCM_OBSERVE_CONTROL_TOG_DIVIDE_MASK)

#define CCM_OBSERVE_CONTROL_TOG_OFF_MASK         (0x1000000U)
#define CCM_OBSERVE_CONTROL_TOG_OFF_SHIFT        (24U)
/*! OFF - Turn off */
#define CCM_OBSERVE_CONTROL_TOG_OFF(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_CONTROL_TOG_OFF_SHIFT)) & CCM_OBSERVE_CONTROL_TOG_OFF_MASK)
/*! @} */

/* The count of CCM_OBSERVE_CONTROL_TOG */
#define CCM_OBSERVE_CONTROL_TOG_COUNT            (2U)

/*! @name OBSERVE_STATUS - Observe status */
/*! @{ */

#define CCM_OBSERVE_STATUS_SELECT_MASK           (0x1FFU)
#define CCM_OBSERVE_STATUS_SELECT_SHIFT          (0U)
/*! SELECT - Observe signal selector */
#define CCM_OBSERVE_STATUS_SELECT(x)             (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_SELECT_SHIFT)) & CCM_OBSERVE_STATUS_SELECT_MASK)

#define CCM_OBSERVE_STATUS_RAW_MASK              (0x1000U)
#define CCM_OBSERVE_STATUS_RAW_SHIFT             (12U)
/*! RAW - Observe raw signal
 *  0b0..Select divided signal.
 *  0b1..Select raw signal.
 */
#define CCM_OBSERVE_STATUS_RAW(x)                (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_RAW_SHIFT)) & CCM_OBSERVE_STATUS_RAW_MASK)

#define CCM_OBSERVE_STATUS_INV_MASK              (0x2000U)
#define CCM_OBSERVE_STATUS_INV_SHIFT             (13U)
/*! INV - Invert
 *  0b0..Clock phase remain same.
 *  0b1..Invert clock phase before measurement or send to IO.
 */
#define CCM_OBSERVE_STATUS_INV(x)                (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_INV_SHIFT)) & CCM_OBSERVE_STATUS_INV_MASK)

#define CCM_OBSERVE_STATUS_RESET_MASK            (0x8000U)
#define CCM_OBSERVE_STATUS_RESET_SHIFT           (15U)
/*! RESET - Reset state
 *  0b0..Observe divider is not in reset state
 *  0b1..Observe divider is in reset state
 */
#define CCM_OBSERVE_STATUS_RESET(x)              (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_RESET_SHIFT)) & CCM_OBSERVE_STATUS_RESET_MASK)

#define CCM_OBSERVE_STATUS_DIVIDE_MASK           (0xFF0000U)
#define CCM_OBSERVE_STATUS_DIVIDE_SHIFT          (16U)
/*! DIVIDE - Divider for observe signal */
#define CCM_OBSERVE_STATUS_DIVIDE(x)             (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_DIVIDE_SHIFT)) & CCM_OBSERVE_STATUS_DIVIDE_MASK)

#define CCM_OBSERVE_STATUS_OFF_MASK              (0x1000000U)
#define CCM_OBSERVE_STATUS_OFF_SHIFT             (24U)
/*! OFF - Turn off slice
 *  0b0..observe slice is on
 *  0b1..observe slice is off
 */
#define CCM_OBSERVE_STATUS_OFF(x)                (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_OFF_SHIFT)) & CCM_OBSERVE_STATUS_OFF_MASK)

#define CCM_OBSERVE_STATUS_FREQ_MEASURE_DONE_MASK (0x2000000U)
#define CCM_OBSERVE_STATUS_FREQ_MEASURE_DONE_SHIFT (25U)
/*! FREQ_MEASURE_DONE - frequency measurement done flag
 *  0b0..Frequency measurement is on-going or not started
 *  0b1..Frequency measurement is done.
 */
#define CCM_OBSERVE_STATUS_FREQ_MEASURE_DONE(x)  (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_FREQ_MEASURE_DONE_SHIFT)) & CCM_OBSERVE_STATUS_FREQ_MEASURE_DONE_MASK)

#define CCM_OBSERVE_STATUS_BUSY_MASK             (0x10000000U)
#define CCM_OBSERVE_STATUS_BUSY_SHIFT            (28U)
/*! BUSY - Busy
 *  0b0..Current observe is not busy
 *  0b1..Current observe is busy
 */
#define CCM_OBSERVE_STATUS_BUSY(x)               (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_BUSY_SHIFT)) & CCM_OBSERVE_STATUS_BUSY_MASK)

#define CCM_OBSERVE_STATUS_UPDATED_FORWARD_MASK  (0x20000000U)
#define CCM_OBSERVE_STATUS_UPDATED_FORWARD_SHIFT (29U)
/*! UPDATED_FORWARD - Update Forward */
#define CCM_OBSERVE_STATUS_UPDATED_FORWARD(x)    (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_UPDATED_FORWARD_SHIFT)) & CCM_OBSERVE_STATUS_UPDATED_FORWARD_MASK)

#define CCM_OBSERVE_STATUS_CHANGING_MASK         (0x80000000U)
#define CCM_OBSERVE_STATUS_CHANGING_SHIFT        (31U)
/*! CHANGING - Busy */
#define CCM_OBSERVE_STATUS_CHANGING(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_STATUS_CHANGING_SHIFT)) & CCM_OBSERVE_STATUS_CHANGING_MASK)
/*! @} */

/* The count of CCM_OBSERVE_STATUS */
#define CCM_OBSERVE_STATUS_COUNT                 (2U)

/*! @name OBSERVE_AUTHEN - Observe access control */
/*! @{ */

#define CCM_OBSERVE_AUTHEN_TZ_USER_MASK          (0x100U)
#define CCM_OBSERVE_AUTHEN_TZ_USER_SHIFT         (8U)
/*! TZ_USER - User access permission
 *  0b0..Observe slice settings cannot be changed in user mode.
 *  0b1..Observe slice settings can be changed in user mode.
 */
#define CCM_OBSERVE_AUTHEN_TZ_USER(x)            (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_TZ_USER_SHIFT)) & CCM_OBSERVE_AUTHEN_TZ_USER_MASK)

#define CCM_OBSERVE_AUTHEN_TZ_NS_MASK            (0x200U)
#define CCM_OBSERVE_AUTHEN_TZ_NS_SHIFT           (9U)
/*! TZ_NS - Non-secure access permission
 *  0b0..Cannot be changed in non-secure mode.
 *  0b1..Can be changed in non-secure mode.
 */
#define CCM_OBSERVE_AUTHEN_TZ_NS(x)              (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_TZ_NS_SHIFT)) & CCM_OBSERVE_AUTHEN_TZ_NS_MASK)

#define CCM_OBSERVE_AUTHEN_LOCK_TZ_MASK          (0x800U)
#define CCM_OBSERVE_AUTHEN_LOCK_TZ_SHIFT         (11U)
/*! LOCK_TZ - Lock TrustZone setting
 *  0b0..TrustZone settings is not locked.
 *  0b1..TrustZone settings is locked.
 */
#define CCM_OBSERVE_AUTHEN_LOCK_TZ(x)            (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_LOCK_TZ_SHIFT)) & CCM_OBSERVE_AUTHEN_LOCK_TZ_MASK)

