tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_CCM.h
#define CCM_OBSERVE_AUTHEN_LOCK_LIST_MASK        (0x8000U)
#define CCM_OBSERVE_AUTHEN_LOCK_LIST_SHIFT       (15U)
/*! LOCK_LIST - Lock white list
 *  0b0..White list is not locked.
 *  0b1..White list is locked.
 */
#define CCM_OBSERVE_AUTHEN_LOCK_LIST(x)          (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_LOCK_LIST_SHIFT)) & CCM_OBSERVE_AUTHEN_LOCK_LIST_MASK)

#define CCM_OBSERVE_AUTHEN_WHITE_LIST_MASK       (0xFFFF0000U)
#define CCM_OBSERVE_AUTHEN_WHITE_LIST_SHIFT      (16U)
/*! WHITE_LIST - Whitelist settings
 *  0b0000000000000000..No domain can change.
 *  0b0000000000000001..Domain 0 can change.
 *  0b0000000000000010..Domain 1 can change.
 *  0b0000000000000011..Domain 0 and domain 1 can change.
 *  0b0000000000000100..Domain 2 can change.
 *  0b0000000000001111..All domain can change.
 */
#define CCM_OBSERVE_AUTHEN_WHITE_LIST(x)         (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_WHITE_LIST_SHIFT)) & CCM_OBSERVE_AUTHEN_WHITE_LIST_MASK)
/*! @} */

/* The count of CCM_OBSERVE_AUTHEN */
#define CCM_OBSERVE_AUTHEN_COUNT                 (2U)

/*! @name OBSERVE_AUTHEN_SET - Observe access control */
/*! @{ */

#define CCM_OBSERVE_AUTHEN_SET_TZ_USER_MASK      (0x100U)
#define CCM_OBSERVE_AUTHEN_SET_TZ_USER_SHIFT     (8U)
/*! TZ_USER - User access permission */
#define CCM_OBSERVE_AUTHEN_SET_TZ_USER(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_SET_TZ_USER_SHIFT)) & CCM_OBSERVE_AUTHEN_SET_TZ_USER_MASK)

#define CCM_OBSERVE_AUTHEN_SET_TZ_NS_MASK        (0x200U)
#define CCM_OBSERVE_AUTHEN_SET_TZ_NS_SHIFT       (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_OBSERVE_AUTHEN_SET_TZ_NS(x)          (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_SET_TZ_NS_SHIFT)) & CCM_OBSERVE_AUTHEN_SET_TZ_NS_MASK)

#define CCM_OBSERVE_AUTHEN_SET_LOCK_TZ_MASK      (0x800U)
#define CCM_OBSERVE_AUTHEN_SET_LOCK_TZ_SHIFT     (11U)
/*! LOCK_TZ - Lock TrustZone setting */
#define CCM_OBSERVE_AUTHEN_SET_LOCK_TZ(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_SET_LOCK_TZ_SHIFT)) & CCM_OBSERVE_AUTHEN_SET_LOCK_TZ_MASK)

#define CCM_OBSERVE_AUTHEN_SET_LOCK_LIST_MASK    (0x8000U)
#define CCM_OBSERVE_AUTHEN_SET_LOCK_LIST_SHIFT   (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_OBSERVE_AUTHEN_SET_LOCK_LIST(x)      (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_SET_LOCK_LIST_SHIFT)) & CCM_OBSERVE_AUTHEN_SET_LOCK_LIST_MASK)

#define CCM_OBSERVE_AUTHEN_SET_WHITE_LIST_MASK   (0xFFFF0000U)
#define CCM_OBSERVE_AUTHEN_SET_WHITE_LIST_SHIFT  (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_OBSERVE_AUTHEN_SET_WHITE_LIST(x)     (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_SET_WHITE_LIST_SHIFT)) & CCM_OBSERVE_AUTHEN_SET_WHITE_LIST_MASK)
/*! @} */

/* The count of CCM_OBSERVE_AUTHEN_SET */
#define CCM_OBSERVE_AUTHEN_SET_COUNT             (2U)

/*! @name OBSERVE_AUTHEN_CLR - Observe access control */
/*! @{ */

#define CCM_OBSERVE_AUTHEN_CLR_TZ_USER_MASK      (0x100U)
#define CCM_OBSERVE_AUTHEN_CLR_TZ_USER_SHIFT     (8U)
/*! TZ_USER - User access permission */
#define CCM_OBSERVE_AUTHEN_CLR_TZ_USER(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_CLR_TZ_USER_SHIFT)) & CCM_OBSERVE_AUTHEN_CLR_TZ_USER_MASK)

#define CCM_OBSERVE_AUTHEN_CLR_TZ_NS_MASK        (0x200U)
#define CCM_OBSERVE_AUTHEN_CLR_TZ_NS_SHIFT       (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_OBSERVE_AUTHEN_CLR_TZ_NS(x)          (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_CLR_TZ_NS_SHIFT)) & CCM_OBSERVE_AUTHEN_CLR_TZ_NS_MASK)

#define CCM_OBSERVE_AUTHEN_CLR_LOCK_TZ_MASK      (0x800U)
#define CCM_OBSERVE_AUTHEN_CLR_LOCK_TZ_SHIFT     (11U)
/*! LOCK_TZ - Lock TrustZone setting */
#define CCM_OBSERVE_AUTHEN_CLR_LOCK_TZ(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_CLR_LOCK_TZ_SHIFT)) & CCM_OBSERVE_AUTHEN_CLR_LOCK_TZ_MASK)

#define CCM_OBSERVE_AUTHEN_CLR_LOCK_LIST_MASK    (0x8000U)
#define CCM_OBSERVE_AUTHEN_CLR_LOCK_LIST_SHIFT   (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_OBSERVE_AUTHEN_CLR_LOCK_LIST(x)      (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_CLR_LOCK_LIST_SHIFT)) & CCM_OBSERVE_AUTHEN_CLR_LOCK_LIST_MASK)

#define CCM_OBSERVE_AUTHEN_CLR_WHITE_LIST_MASK   (0xFFFF0000U)
#define CCM_OBSERVE_AUTHEN_CLR_WHITE_LIST_SHIFT  (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_OBSERVE_AUTHEN_CLR_WHITE_LIST(x)     (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_CLR_WHITE_LIST_SHIFT)) & CCM_OBSERVE_AUTHEN_CLR_WHITE_LIST_MASK)
/*! @} */

/* The count of CCM_OBSERVE_AUTHEN_CLR */
#define CCM_OBSERVE_AUTHEN_CLR_COUNT             (2U)

/*! @name OBSERVE_AUTHEN_TOG - Observe access control */
/*! @{ */

#define CCM_OBSERVE_AUTHEN_TOG_TZ_USER_MASK      (0x100U)
#define CCM_OBSERVE_AUTHEN_TOG_TZ_USER_SHIFT     (8U)
/*! TZ_USER - User access permission */
#define CCM_OBSERVE_AUTHEN_TOG_TZ_USER(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_TOG_TZ_USER_SHIFT)) & CCM_OBSERVE_AUTHEN_TOG_TZ_USER_MASK)

#define CCM_OBSERVE_AUTHEN_TOG_TZ_NS_MASK        (0x200U)
#define CCM_OBSERVE_AUTHEN_TOG_TZ_NS_SHIFT       (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_OBSERVE_AUTHEN_TOG_TZ_NS(x)          (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_TOG_TZ_NS_SHIFT)) & CCM_OBSERVE_AUTHEN_TOG_TZ_NS_MASK)

#define CCM_OBSERVE_AUTHEN_TOG_LOCK_TZ_MASK      (0x800U)
#define CCM_OBSERVE_AUTHEN_TOG_LOCK_TZ_SHIFT     (11U)
/*! LOCK_TZ - Lock TrustZone setting */
#define CCM_OBSERVE_AUTHEN_TOG_LOCK_TZ(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_TOG_LOCK_TZ_SHIFT)) & CCM_OBSERVE_AUTHEN_TOG_LOCK_TZ_MASK)

#define CCM_OBSERVE_AUTHEN_TOG_LOCK_LIST_MASK    (0x8000U)
#define CCM_OBSERVE_AUTHEN_TOG_LOCK_LIST_SHIFT   (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_OBSERVE_AUTHEN_TOG_LOCK_LIST(x)      (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_TOG_LOCK_LIST_SHIFT)) & CCM_OBSERVE_AUTHEN_TOG_LOCK_LIST_MASK)

#define CCM_OBSERVE_AUTHEN_TOG_WHITE_LIST_MASK   (0xFFFF0000U)
#define CCM_OBSERVE_AUTHEN_TOG_WHITE_LIST_SHIFT  (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_OBSERVE_AUTHEN_TOG_WHITE_LIST(x)     (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_AUTHEN_TOG_WHITE_LIST_SHIFT)) & CCM_OBSERVE_AUTHEN_TOG_WHITE_LIST_MASK)
/*! @} */

