tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_CCM.h
/* The count of CCM_OBSERVE_AUTHEN_TOG */
#define CCM_OBSERVE_AUTHEN_TOG_COUNT             (2U)

/*! @name OBSERVE_FREQUENCY_CURRENT - Current frequency detected */
/*! @{ */

#define CCM_OBSERVE_FREQUENCY_CURRENT_FREQUENCY_MASK (0xFFFFFFFFU)
#define CCM_OBSERVE_FREQUENCY_CURRENT_FREQUENCY_SHIFT (0U)
/*! FREQUENCY - Frequency */
#define CCM_OBSERVE_FREQUENCY_CURRENT_FREQUENCY(x) (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_FREQUENCY_CURRENT_FREQUENCY_SHIFT)) & CCM_OBSERVE_FREQUENCY_CURRENT_FREQUENCY_MASK)
/*! @} */

/* The count of CCM_OBSERVE_FREQUENCY_CURRENT */
#define CCM_OBSERVE_FREQUENCY_CURRENT_COUNT      (2U)

/*! @name OBSERVE_FREQUENCY_MIN - Minimum frequency detected */
/*! @{ */

#define CCM_OBSERVE_FREQUENCY_MIN_FREQUENCY_MASK (0xFFFFFFFFU)
#define CCM_OBSERVE_FREQUENCY_MIN_FREQUENCY_SHIFT (0U)
/*! FREQUENCY - Frequency */
#define CCM_OBSERVE_FREQUENCY_MIN_FREQUENCY(x)   (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_FREQUENCY_MIN_FREQUENCY_SHIFT)) & CCM_OBSERVE_FREQUENCY_MIN_FREQUENCY_MASK)
/*! @} */

/* The count of CCM_OBSERVE_FREQUENCY_MIN */
#define CCM_OBSERVE_FREQUENCY_MIN_COUNT          (2U)

/*! @name OBSERVE_FREQUENCY_MAX - Maximum frequency detected */
/*! @{ */

#define CCM_OBSERVE_FREQUENCY_MAX_FREQUENCY_MASK (0xFFFFFFFFU)
#define CCM_OBSERVE_FREQUENCY_MAX_FREQUENCY_SHIFT (0U)
/*! FREQUENCY - Frequency */
#define CCM_OBSERVE_FREQUENCY_MAX_FREQUENCY(x)   (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_FREQUENCY_MAX_FREQUENCY_SHIFT)) & CCM_OBSERVE_FREQUENCY_MAX_FREQUENCY_MASK)
/*! @} */

/* The count of CCM_OBSERVE_FREQUENCY_MAX */
#define CCM_OBSERVE_FREQUENCY_MAX_COUNT          (2U)

/*! @name OBSERVE_PERIOD_CURRENT - Current period time detected */
/*! @{ */

#define CCM_OBSERVE_PERIOD_CURRENT_PERIOD_MASK   (0xFFFFFFFFU)
#define CCM_OBSERVE_PERIOD_CURRENT_PERIOD_SHIFT  (0U)
/*! PERIOD - Period time */
#define CCM_OBSERVE_PERIOD_CURRENT_PERIOD(x)     (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_PERIOD_CURRENT_PERIOD_SHIFT)) & CCM_OBSERVE_PERIOD_CURRENT_PERIOD_MASK)
/*! @} */

/* The count of CCM_OBSERVE_PERIOD_CURRENT */
#define CCM_OBSERVE_PERIOD_CURRENT_COUNT         (2U)

/*! @name OBSERVE_PERIOD_MIN - Minimum period time detected */
/*! @{ */

#define CCM_OBSERVE_PERIOD_MIN_PERIOD_MASK       (0xFFFFFFFFU)
#define CCM_OBSERVE_PERIOD_MIN_PERIOD_SHIFT      (0U)
/*! PERIOD - Period time */
#define CCM_OBSERVE_PERIOD_MIN_PERIOD(x)         (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_PERIOD_MIN_PERIOD_SHIFT)) & CCM_OBSERVE_PERIOD_MIN_PERIOD_MASK)
/*! @} */

/* The count of CCM_OBSERVE_PERIOD_MIN */
#define CCM_OBSERVE_PERIOD_MIN_COUNT             (2U)

/*! @name OBSERVE_PERIOD_MAX - Maximum period time detected */
/*! @{ */

#define CCM_OBSERVE_PERIOD_MAX_PERIOD_MASK       (0xFFFFFFFFU)
#define CCM_OBSERVE_PERIOD_MAX_PERIOD_SHIFT      (0U)
/*! PERIOD - Period time */
#define CCM_OBSERVE_PERIOD_MAX_PERIOD(x)         (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_PERIOD_MAX_PERIOD_SHIFT)) & CCM_OBSERVE_PERIOD_MAX_PERIOD_MASK)
/*! @} */

/* The count of CCM_OBSERVE_PERIOD_MAX */
#define CCM_OBSERVE_PERIOD_MAX_COUNT             (2U)

/*! @name OBSERVE_HIGH_CURRENT - Current high level time detected */
/*! @{ */

#define CCM_OBSERVE_HIGH_CURRENT_HIGH_MASK       (0xFFFFFFFFU)
#define CCM_OBSERVE_HIGH_CURRENT_HIGH_SHIFT      (0U)
/*! HIGH - High level time */
#define CCM_OBSERVE_HIGH_CURRENT_HIGH(x)         (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_HIGH_CURRENT_HIGH_SHIFT)) & CCM_OBSERVE_HIGH_CURRENT_HIGH_MASK)
/*! @} */

/* The count of CCM_OBSERVE_HIGH_CURRENT */
#define CCM_OBSERVE_HIGH_CURRENT_COUNT           (2U)

/*! @name OBSERVE_HIGH_MIN - Minimum high level time detected */
/*! @{ */

#define CCM_OBSERVE_HIGH_MIN_HIGH_MASK           (0xFFFFFFFFU)
#define CCM_OBSERVE_HIGH_MIN_HIGH_SHIFT          (0U)
/*! HIGH - High level time */
#define CCM_OBSERVE_HIGH_MIN_HIGH(x)             (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_HIGH_MIN_HIGH_SHIFT)) & CCM_OBSERVE_HIGH_MIN_HIGH_MASK)
/*! @} */

/* The count of CCM_OBSERVE_HIGH_MIN */
#define CCM_OBSERVE_HIGH_MIN_COUNT               (2U)

/*! @name OBSERVE_HIGH_MAX - Maximum high level time detected */
/*! @{ */

#define CCM_OBSERVE_HIGH_MAX_HIGH_MASK           (0xFFFFFFFFU)
#define CCM_OBSERVE_HIGH_MAX_HIGH_SHIFT          (0U)
/*! HIGH - High level time */
#define CCM_OBSERVE_HIGH_MAX_HIGH(x)             (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_HIGH_MAX_HIGH_SHIFT)) & CCM_OBSERVE_HIGH_MAX_HIGH_MASK)
/*! @} */

/* The count of CCM_OBSERVE_HIGH_MAX */
#define CCM_OBSERVE_HIGH_MAX_COUNT               (2U)

/*! @name OBSERVE_LOW_CURRENT - Current high level time detected */
/*! @{ */

#define CCM_OBSERVE_LOW_CURRENT_LOW_MASK         (0xFFFFFFFFU)
#define CCM_OBSERVE_LOW_CURRENT_LOW_SHIFT        (0U)
/*! LOW - High level time */
#define CCM_OBSERVE_LOW_CURRENT_LOW(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_LOW_CURRENT_LOW_SHIFT)) & CCM_OBSERVE_LOW_CURRENT_LOW_MASK)
/*! @} */

/* The count of CCM_OBSERVE_LOW_CURRENT */
#define CCM_OBSERVE_LOW_CURRENT_COUNT            (2U)

/*! @name OBSERVE_LOW_MIN - Minimum high level time detected */
/*! @{ */

#define CCM_OBSERVE_LOW_MIN_LOW_MASK             (0xFFFFFFFFU)
#define CCM_OBSERVE_LOW_MIN_LOW_SHIFT            (0U)
/*! LOW - High level time */
#define CCM_OBSERVE_LOW_MIN_LOW(x)               (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_LOW_MIN_LOW_SHIFT)) & CCM_OBSERVE_LOW_MIN_LOW_MASK)
/*! @} */

/* The count of CCM_OBSERVE_LOW_MIN */
#define CCM_OBSERVE_LOW_MIN_COUNT                (2U)

/*! @name OBSERVE_LOW_MAX - Maximum high level time detected */
/*! @{ */

#define CCM_OBSERVE_LOW_MAX_LOW_MASK             (0xFFFFFFFFU)
#define CCM_OBSERVE_LOW_MAX_LOW_SHIFT            (0U)
/*! LOW - High level time */
#define CCM_OBSERVE_LOW_MAX_LOW(x)               (((uint32_t)(((uint32_t)(x)) << CCM_OBSERVE_LOW_MAX_LOW_SHIFT)) & CCM_OBSERVE_LOW_MAX_LOW_MASK)
/*! @} */

/* The count of CCM_OBSERVE_LOW_MAX */
#define CCM_OBSERVE_LOW_MAX_COUNT                (2U)

