tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_CCM.h
#define CCM_GPR_SHARED3_CLR_m33_mask_lpi2c5_MASK (0x400000U)
#define CCM_GPR_SHARED3_CLR_m33_mask_lpi2c5_SHIFT (22U)
/*! m33_mask_lpi2c5 - m33_mask_lpi2c5 */
#define CCM_GPR_SHARED3_CLR_m33_mask_lpi2c5(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_CLR_m33_mask_lpi2c5_SHIFT)) & CCM_GPR_SHARED3_CLR_m33_mask_lpi2c5_MASK)

#define CCM_GPR_SHARED3_CLR_m33_mask_lpi2c6_MASK (0x800000U)
#define CCM_GPR_SHARED3_CLR_m33_mask_lpi2c6_SHIFT (23U)
/*! m33_mask_lpi2c6 - m33_mask_lpi2c6 */
#define CCM_GPR_SHARED3_CLR_m33_mask_lpi2c6(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_CLR_m33_mask_lpi2c6_SHIFT)) & CCM_GPR_SHARED3_CLR_m33_mask_lpi2c6_MASK)

#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi1_MASK (0x1000000U)
#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi1_SHIFT (24U)
/*! m33_mask_lpspi1 - m33_mask_lpspi1 */
#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi1(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_CLR_m33_mask_lpspi1_SHIFT)) & CCM_GPR_SHARED3_CLR_m33_mask_lpspi1_MASK)

#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi2_MASK (0x2000000U)
#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi2_SHIFT (25U)
/*! m33_mask_lpspi2 - m33_mask_lpspi2 */
#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi2(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_CLR_m33_mask_lpspi2_SHIFT)) & CCM_GPR_SHARED3_CLR_m33_mask_lpspi2_MASK)

#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi3_MASK (0x4000000U)
#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi3_SHIFT (26U)
/*! m33_mask_lpspi3 - m33_mask_lpspi3 */
#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi3(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_CLR_m33_mask_lpspi3_SHIFT)) & CCM_GPR_SHARED3_CLR_m33_mask_lpspi3_MASK)

#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi4_MASK (0x8000000U)
#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi4_SHIFT (27U)
/*! m33_mask_lpspi4 - m33_mask_lpspi4 */
#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi4(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_CLR_m33_mask_lpspi4_SHIFT)) & CCM_GPR_SHARED3_CLR_m33_mask_lpspi4_MASK)

#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi5_MASK (0x10000000U)
#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi5_SHIFT (28U)
/*! m33_mask_lpspi5 - m33_mask_lpspi5 */
#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi5(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_CLR_m33_mask_lpspi5_SHIFT)) & CCM_GPR_SHARED3_CLR_m33_mask_lpspi5_MASK)

#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi6_MASK (0x20000000U)
#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi6_SHIFT (29U)
/*! m33_mask_lpspi6 - m33_mask_lpspi6 */
#define CCM_GPR_SHARED3_CLR_m33_mask_lpspi6(x)   (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_CLR_m33_mask_lpspi6_SHIFT)) & CCM_GPR_SHARED3_CLR_m33_mask_lpspi6_MASK)

#define CCM_GPR_SHARED3_CLR_m33_mask_sinc1_MASK  (0x40000000U)
#define CCM_GPR_SHARED3_CLR_m33_mask_sinc1_SHIFT (30U)
/*! m33_mask_sinc1 - m33_mask_sinc1 */
#define CCM_GPR_SHARED3_CLR_m33_mask_sinc1(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_CLR_m33_mask_sinc1_SHIFT)) & CCM_GPR_SHARED3_CLR_m33_mask_sinc1_MASK)

#define CCM_GPR_SHARED3_CLR_m33_mask_sinc2_MASK  (0x80000000U)
#define CCM_GPR_SHARED3_CLR_m33_mask_sinc2_SHIFT (31U)
/*! m33_mask_sinc2 - m33_mask_sinc2 */
#define CCM_GPR_SHARED3_CLR_m33_mask_sinc2(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_CLR_m33_mask_sinc2_SHIFT)) & CCM_GPR_SHARED3_CLR_m33_mask_sinc2_MASK)
/*! @} */

/*! @name GPR_SHARED3_TOG - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED3_TOG_m33_mask_tpm6_MASK   (0x1U)
#define CCM_GPR_SHARED3_TOG_m33_mask_tpm6_SHIFT  (0U)
/*! m33_mask_tpm6 - m33_mask_tpm6 */
#define CCM_GPR_SHARED3_TOG_m33_mask_tpm6(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_TOG_m33_mask_tpm6_SHIFT)) & CCM_GPR_SHARED3_TOG_m33_mask_tpm6_MASK)

#define CCM_GPR_SHARED3_TOG_m33_mask_gpt1_MASK   (0x2U)
#define CCM_GPR_SHARED3_TOG_m33_mask_gpt1_SHIFT  (1U)
/*! m33_mask_gpt1 - m33_mask_gpt1 */
#define CCM_GPR_SHARED3_TOG_m33_mask_gpt1(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_TOG_m33_mask_gpt1_SHIFT)) & CCM_GPR_SHARED3_TOG_m33_mask_gpt1_MASK)

#define CCM_GPR_SHARED3_TOG_m33_mask_gpt2_MASK   (0x4U)
#define CCM_GPR_SHARED3_TOG_m33_mask_gpt2_SHIFT  (2U)
/*! m33_mask_gpt2 - m33_mask_gpt2 */
#define CCM_GPR_SHARED3_TOG_m33_mask_gpt2(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_TOG_m33_mask_gpt2_SHIFT)) & CCM_GPR_SHARED3_TOG_m33_mask_gpt2_MASK)

#define CCM_GPR_SHARED3_TOG_m33_mask_can1_MASK   (0x8U)
#define CCM_GPR_SHARED3_TOG_m33_mask_can1_SHIFT  (3U)
/*! m33_mask_can1 - m33_mask_can1 */
#define CCM_GPR_SHARED3_TOG_m33_mask_can1(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_TOG_m33_mask_can1_SHIFT)) & CCM_GPR_SHARED3_TOG_m33_mask_can1_MASK)

#define CCM_GPR_SHARED3_TOG_m33_mask_can2_MASK   (0x10U)
#define CCM_GPR_SHARED3_TOG_m33_mask_can2_SHIFT  (4U)
/*! m33_mask_can2 - m33_mask_can2 */
#define CCM_GPR_SHARED3_TOG_m33_mask_can2(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_TOG_m33_mask_can2_SHIFT)) & CCM_GPR_SHARED3_TOG_m33_mask_can2_MASK)

#define CCM_GPR_SHARED3_TOG_m33_mask_can3_MASK   (0x20U)
#define CCM_GPR_SHARED3_TOG_m33_mask_can3_SHIFT  (5U)
/*! m33_mask_can3 - m33_mask_can3 */
#define CCM_GPR_SHARED3_TOG_m33_mask_can3(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_TOG_m33_mask_can3_SHIFT)) & CCM_GPR_SHARED3_TOG_m33_mask_can3_MASK)

#define CCM_GPR_SHARED3_TOG_m33_mask_lpuart1_MASK (0x40U)
#define CCM_GPR_SHARED3_TOG_m33_mask_lpuart1_SHIFT (6U)
/*! m33_mask_lpuart1 - m33_mask_lpuart1 */
#define CCM_GPR_SHARED3_TOG_m33_mask_lpuart1(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_TOG_m33_mask_lpuart1_SHIFT)) & CCM_GPR_SHARED3_TOG_m33_mask_lpuart1_MASK)

#define CCM_GPR_SHARED3_TOG_m33_mask_lpuart2_MASK (0x80U)
#define CCM_GPR_SHARED3_TOG_m33_mask_lpuart2_SHIFT (7U)
/*! m33_mask_lpuart2 - m33_mask_lpuart2 */
#define CCM_GPR_SHARED3_TOG_m33_mask_lpuart2(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_TOG_m33_mask_lpuart2_SHIFT)) & CCM_GPR_SHARED3_TOG_m33_mask_lpuart2_MASK)

#define CCM_GPR_SHARED3_TOG_m33_mask_lpuart3_MASK (0x100U)
#define CCM_GPR_SHARED3_TOG_m33_mask_lpuart3_SHIFT (8U)
/*! m33_mask_lpuart3 - m33_mask_lpuart3 */
#define CCM_GPR_SHARED3_TOG_m33_mask_lpuart3(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED3_TOG_m33_mask_lpuart3_SHIFT)) & CCM_GPR_SHARED3_TOG_m33_mask_lpuart3_MASK)

