tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_CCM.h
#define CCM_GPR_SHARED8_TOG_m33_gpio2_ipg_stop_MASK (0x20000U)
#define CCM_GPR_SHARED8_TOG_m33_gpio2_ipg_stop_SHIFT (17U)
/*! m33_gpio2_ipg_stop - m33_gpio2_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_gpio2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_gpio2_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_gpio2_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_gpio3_ipg_stop_MASK (0x40000U)
#define CCM_GPR_SHARED8_TOG_m33_gpio3_ipg_stop_SHIFT (18U)
/*! m33_gpio3_ipg_stop - m33_gpio3_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_gpio3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_gpio3_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_gpio3_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_gpio4_ipg_stop_MASK (0x80000U)
#define CCM_GPR_SHARED8_TOG_m33_gpio4_ipg_stop_SHIFT (19U)
/*! m33_gpio4_ipg_stop - m33_gpio4_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_gpio4_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_gpio4_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_gpio4_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_gpio5_ipg_stop_MASK (0x100000U)
#define CCM_GPR_SHARED8_TOG_m33_gpio5_ipg_stop_SHIFT (20U)
/*! m33_gpio5_ipg_stop - m33_gpio5_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_gpio5_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_gpio5_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_gpio5_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_gpio6_ipg_stop_MASK (0x200000U)
#define CCM_GPR_SHARED8_TOG_m33_gpio6_ipg_stop_SHIFT (21U)
/*! m33_gpio6_ipg_stop - m33_gpio6_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_gpio6_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_gpio6_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_gpio6_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_flexio1_ipg_stop_MASK (0x400000U)
#define CCM_GPR_SHARED8_TOG_m33_flexio1_ipg_stop_SHIFT (22U)
/*! m33_flexio1_ipg_stop - m33_flexio1_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_flexio1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_flexio1_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_flexio1_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_flexio2_ipg_stop_MASK (0x800000U)
#define CCM_GPR_SHARED8_TOG_m33_flexio2_ipg_stop_SHIFT (23U)
/*! m33_flexio2_ipg_stop - m33_flexio2_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_flexio2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_flexio2_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_flexio2_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_can1_ipg_stop_MASK (0x1000000U)
#define CCM_GPR_SHARED8_TOG_m33_can1_ipg_stop_SHIFT (24U)
/*! m33_can1_ipg_stop - m33_can1_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_can1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_can1_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_can1_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_can2_ipg_stop_MASK (0x2000000U)
#define CCM_GPR_SHARED8_TOG_m33_can2_ipg_stop_SHIFT (25U)
/*! m33_can2_ipg_stop - m33_can2_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_can2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_can2_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_can2_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_can3_ipg_stop_MASK (0x4000000U)
#define CCM_GPR_SHARED8_TOG_m33_can3_ipg_stop_SHIFT (26U)
/*! m33_can3_ipg_stop - m33_can3_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_can3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_can3_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_can3_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_lpuart1_ipg_stop_MASK (0x8000000U)
#define CCM_GPR_SHARED8_TOG_m33_lpuart1_ipg_stop_SHIFT (27U)
/*! m33_lpuart1_ipg_stop - m33_lpuart1_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_lpuart1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_lpuart1_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_lpuart1_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_lpuart2_ipg_stop_MASK (0x10000000U)
#define CCM_GPR_SHARED8_TOG_m33_lpuart2_ipg_stop_SHIFT (28U)
/*! m33_lpuart2_ipg_stop - m33_lpuart2_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_lpuart2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_lpuart2_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_lpuart2_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_lpuart3_ipg_stop_MASK (0x20000000U)
#define CCM_GPR_SHARED8_TOG_m33_lpuart3_ipg_stop_SHIFT (29U)
/*! m33_lpuart3_ipg_stop - m33_lpuart3_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_lpuart3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_lpuart3_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_lpuart3_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_lpuart4_ipg_stop_MASK (0x40000000U)
#define CCM_GPR_SHARED8_TOG_m33_lpuart4_ipg_stop_SHIFT (30U)
/*! m33_lpuart4_ipg_stop - m33_lpuart4_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_lpuart4_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_lpuart4_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_lpuart4_ipg_stop_MASK)

#define CCM_GPR_SHARED8_TOG_m33_lpuart5_ipg_stop_MASK (0x80000000U)
#define CCM_GPR_SHARED8_TOG_m33_lpuart5_ipg_stop_SHIFT (31U)
/*! m33_lpuart5_ipg_stop - m33_lpuart5_ipg_stop */
#define CCM_GPR_SHARED8_TOG_m33_lpuart5_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_TOG_m33_lpuart5_ipg_stop_SHIFT)) & CCM_GPR_SHARED8_TOG_m33_lpuart5_ipg_stop_MASK)
/*! @} */

/*! @name GPR_SHARED8_AUTHEN - GPR access control */
/*! @{ */

#define CCM_GPR_SHARED8_AUTHEN_TZ_USER_MASK      (0x100U)
#define CCM_GPR_SHARED8_AUTHEN_TZ_USER_SHIFT     (8U)
/*! TZ_USER - User access permission
 *  0b0..Registers of shared GPR slice cannot be changed in user mode.
 *  0b1..Registers of shared GPR slice can be changed in user mode.
 */
#define CCM_GPR_SHARED8_AUTHEN_TZ_USER(x)        (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_AUTHEN_TZ_USER_SHIFT)) & CCM_GPR_SHARED8_AUTHEN_TZ_USER_MASK)

#define CCM_GPR_SHARED8_AUTHEN_TZ_NS_MASK        (0x200U)
#define CCM_GPR_SHARED8_AUTHEN_TZ_NS_SHIFT       (9U)
/*! TZ_NS - Non-secure access permission
 *  0b0..Cannot be changed in Non-secure mode.
 *  0b1..Can be changed in Non-secure mode.
 */
#define CCM_GPR_SHARED8_AUTHEN_TZ_NS(x)          (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED8_AUTHEN_TZ_NS_SHIFT)) & CCM_GPR_SHARED8_AUTHEN_TZ_NS_MASK)

