tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_CCM.h
#define CCM_GPR_SHARED9_TOG_m33_lpspi3_ipg_stop_MASK (0x8000U)
#define CCM_GPR_SHARED9_TOG_m33_lpspi3_ipg_stop_SHIFT (15U)
/*! m33_lpspi3_ipg_stop - m33_lpspi3_ipg_stop */
#define CCM_GPR_SHARED9_TOG_m33_lpspi3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_TOG_m33_lpspi3_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_TOG_m33_lpspi3_ipg_stop_MASK)

#define CCM_GPR_SHARED9_TOG_m33_lpspi4_ipg_stop_MASK (0x10000U)
#define CCM_GPR_SHARED9_TOG_m33_lpspi4_ipg_stop_SHIFT (16U)
/*! m33_lpspi4_ipg_stop - m33_lpspi4_ipg_stop */
#define CCM_GPR_SHARED9_TOG_m33_lpspi4_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_TOG_m33_lpspi4_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_TOG_m33_lpspi4_ipg_stop_MASK)

#define CCM_GPR_SHARED9_TOG_m33_lpspi5_ipg_stop_MASK (0x20000U)
#define CCM_GPR_SHARED9_TOG_m33_lpspi5_ipg_stop_SHIFT (17U)
/*! m33_lpspi5_ipg_stop - m33_lpspi5_ipg_stop */
#define CCM_GPR_SHARED9_TOG_m33_lpspi5_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_TOG_m33_lpspi5_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_TOG_m33_lpspi5_ipg_stop_MASK)

#define CCM_GPR_SHARED9_TOG_m33_lpspi6_ipg_stop_MASK (0x40000U)
#define CCM_GPR_SHARED9_TOG_m33_lpspi6_ipg_stop_SHIFT (18U)
/*! m33_lpspi6_ipg_stop - m33_lpspi6_ipg_stop */
#define CCM_GPR_SHARED9_TOG_m33_lpspi6_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_TOG_m33_lpspi6_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_TOG_m33_lpspi6_ipg_stop_MASK)

#define CCM_GPR_SHARED9_TOG_m33_sinc1_ipg_stop_MASK (0x80000U)
#define CCM_GPR_SHARED9_TOG_m33_sinc1_ipg_stop_SHIFT (19U)
/*! m33_sinc1_ipg_stop - m33_sinc1_ipg_stop */
#define CCM_GPR_SHARED9_TOG_m33_sinc1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_TOG_m33_sinc1_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_TOG_m33_sinc1_ipg_stop_MASK)

#define CCM_GPR_SHARED9_TOG_m33_sinc2_ipg_stop_MASK (0x100000U)
#define CCM_GPR_SHARED9_TOG_m33_sinc2_ipg_stop_SHIFT (20U)
/*! m33_sinc2_ipg_stop - m33_sinc2_ipg_stop */
#define CCM_GPR_SHARED9_TOG_m33_sinc2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_TOG_m33_sinc2_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_TOG_m33_sinc2_ipg_stop_MASK)

#define CCM_GPR_SHARED9_TOG_m33_sinc3_ipg_stop_MASK (0x200000U)
#define CCM_GPR_SHARED9_TOG_m33_sinc3_ipg_stop_SHIFT (21U)
/*! m33_sinc3_ipg_stop - m33_sinc3_ipg_stop */
#define CCM_GPR_SHARED9_TOG_m33_sinc3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_TOG_m33_sinc3_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_TOG_m33_sinc3_ipg_stop_MASK)

#define CCM_GPR_SHARED9_TOG_m33_sai1_ipg_stop_MASK (0x400000U)
#define CCM_GPR_SHARED9_TOG_m33_sai1_ipg_stop_SHIFT (22U)
/*! m33_sai1_ipg_stop - m33_sai1_ipg_stop */
#define CCM_GPR_SHARED9_TOG_m33_sai1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_TOG_m33_sai1_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_TOG_m33_sai1_ipg_stop_MASK)

#define CCM_GPR_SHARED9_TOG_m33_sai2_ipg_stop_MASK (0x800000U)
#define CCM_GPR_SHARED9_TOG_m33_sai2_ipg_stop_SHIFT (23U)
/*! m33_sai2_ipg_stop - m33_sai2_ipg_stop */
#define CCM_GPR_SHARED9_TOG_m33_sai2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_TOG_m33_sai2_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_TOG_m33_sai2_ipg_stop_MASK)

#define CCM_GPR_SHARED9_TOG_m33_sai3_ipg_stop_MASK (0x1000000U)
#define CCM_GPR_SHARED9_TOG_m33_sai3_ipg_stop_SHIFT (24U)
/*! m33_sai3_ipg_stop - m33_sai3_ipg_stop */
#define CCM_GPR_SHARED9_TOG_m33_sai3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_TOG_m33_sai3_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_TOG_m33_sai3_ipg_stop_MASK)

#define CCM_GPR_SHARED9_TOG_m33_sai4_ipg_stop_MASK (0x2000000U)
#define CCM_GPR_SHARED9_TOG_m33_sai4_ipg_stop_SHIFT (25U)
/*! m33_sai4_ipg_stop - m33_sai4_ipg_stop */
#define CCM_GPR_SHARED9_TOG_m33_sai4_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_TOG_m33_sai4_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_TOG_m33_sai4_ipg_stop_MASK)

#define CCM_GPR_SHARED9_TOG_m33_mic_ipg_stop_MASK (0x4000000U)
#define CCM_GPR_SHARED9_TOG_m33_mic_ipg_stop_SHIFT (26U)
/*! m33_mic_ipg_stop - m33_mic_ipg_stop */
#define CCM_GPR_SHARED9_TOG_m33_mic_ipg_stop(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_TOG_m33_mic_ipg_stop_SHIFT)) & CCM_GPR_SHARED9_TOG_m33_mic_ipg_stop_MASK)
/*! @} */

/*! @name GPR_SHARED9_AUTHEN - GPR access control */
/*! @{ */

#define CCM_GPR_SHARED9_AUTHEN_TZ_USER_MASK      (0x100U)
#define CCM_GPR_SHARED9_AUTHEN_TZ_USER_SHIFT     (8U)
/*! TZ_USER - User access permission
 *  0b0..Registers of shared GPR slice cannot be changed in user mode.
 *  0b1..Registers of shared GPR slice can be changed in user mode.
 */
#define CCM_GPR_SHARED9_AUTHEN_TZ_USER(x)        (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_AUTHEN_TZ_USER_SHIFT)) & CCM_GPR_SHARED9_AUTHEN_TZ_USER_MASK)

#define CCM_GPR_SHARED9_AUTHEN_TZ_NS_MASK        (0x200U)
#define CCM_GPR_SHARED9_AUTHEN_TZ_NS_SHIFT       (9U)
/*! TZ_NS - Non-secure access permission
 *  0b0..Cannot be changed in Non-secure mode.
 *  0b1..Can be changed in Non-secure mode.
 */
#define CCM_GPR_SHARED9_AUTHEN_TZ_NS(x)          (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_AUTHEN_TZ_NS_SHIFT)) & CCM_GPR_SHARED9_AUTHEN_TZ_NS_MASK)

#define CCM_GPR_SHARED9_AUTHEN_LOCK_TZ_MASK      (0x800U)
#define CCM_GPR_SHARED9_AUTHEN_LOCK_TZ_SHIFT     (11U)
/*! LOCK_TZ - Lock TrustZone settings
 *  0b0..TrustZone settings is not locked.
 *  0b1..TrustZone settings is locked.
 */
#define CCM_GPR_SHARED9_AUTHEN_LOCK_TZ(x)        (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_AUTHEN_LOCK_TZ_SHIFT)) & CCM_GPR_SHARED9_AUTHEN_LOCK_TZ_MASK)

#define CCM_GPR_SHARED9_AUTHEN_LOCK_LIST_MASK    (0x8000U)
#define CCM_GPR_SHARED9_AUTHEN_LOCK_LIST_SHIFT   (15U)
/*! LOCK_LIST - Lock white list
 *  0b0..Whitelist is not locked.
 *  0b1..Whitelist is locked.
 */
#define CCM_GPR_SHARED9_AUTHEN_LOCK_LIST(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_AUTHEN_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED9_AUTHEN_LOCK_LIST_MASK)

#define CCM_GPR_SHARED9_AUTHEN_WHITE_LIST_MASK   (0xFFFF0000U)
#define CCM_GPR_SHARED9_AUTHEN_WHITE_LIST_SHIFT  (16U)
/*! WHITE_LIST - Whitelist settings */
#define CCM_GPR_SHARED9_AUTHEN_WHITE_LIST(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_AUTHEN_WHITE_LIST_SHIFT)) & CCM_GPR_SHARED9_AUTHEN_WHITE_LIST_MASK)
/*! @} */

/*! @name GPR_SHARED9_AUTHEN_SET - GPR access control */
/*! @{ */

#define CCM_GPR_SHARED9_AUTHEN_SET_TZ_USER_MASK  (0x100U)
#define CCM_GPR_SHARED9_AUTHEN_SET_TZ_USER_SHIFT (8U)
/*! TZ_USER - User access permission */
#define CCM_GPR_SHARED9_AUTHEN_SET_TZ_USER(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_AUTHEN_SET_TZ_USER_SHIFT)) & CCM_GPR_SHARED9_AUTHEN_SET_TZ_USER_MASK)

#define CCM_GPR_SHARED9_AUTHEN_SET_TZ_NS_MASK    (0x200U)
#define CCM_GPR_SHARED9_AUTHEN_SET_TZ_NS_SHIFT   (9U)
/*! TZ_NS - Non-secure access permission */
#define CCM_GPR_SHARED9_AUTHEN_SET_TZ_NS(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_AUTHEN_SET_TZ_NS_SHIFT)) & CCM_GPR_SHARED9_AUTHEN_SET_TZ_NS_MASK)

#define CCM_GPR_SHARED9_AUTHEN_SET_LOCK_TZ_MASK  (0x800U)
#define CCM_GPR_SHARED9_AUTHEN_SET_LOCK_TZ_SHIFT (11U)
/*! LOCK_TZ - Lock TrustZone settings */
#define CCM_GPR_SHARED9_AUTHEN_SET_LOCK_TZ(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_AUTHEN_SET_LOCK_TZ_SHIFT)) & CCM_GPR_SHARED9_AUTHEN_SET_LOCK_TZ_MASK)

#define CCM_GPR_SHARED9_AUTHEN_SET_LOCK_LIST_MASK (0x8000U)
#define CCM_GPR_SHARED9_AUTHEN_SET_LOCK_LIST_SHIFT (15U)
/*! LOCK_LIST - Lock white list */
#define CCM_GPR_SHARED9_AUTHEN_SET_LOCK_LIST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED9_AUTHEN_SET_LOCK_LIST_SHIFT)) & CCM_GPR_SHARED9_AUTHEN_SET_LOCK_LIST_MASK)

