tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_CCM.h
#define CCM_GPR_SHARED10_m33_tpm4_ipg_doze_MASK  (0x1000U)
#define CCM_GPR_SHARED10_m33_tpm4_ipg_doze_SHIFT (12U)
/*! m33_tpm4_ipg_doze - m33_tpm4_ipg_doze */
#define CCM_GPR_SHARED10_m33_tpm4_ipg_doze(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_tpm4_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_tpm4_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_tpm5_ipg_doze_MASK  (0x2000U)
#define CCM_GPR_SHARED10_m33_tpm5_ipg_doze_SHIFT (13U)
/*! m33_tpm5_ipg_doze - m33_tpm5_ipg_doze */
#define CCM_GPR_SHARED10_m33_tpm5_ipg_doze(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_tpm5_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_tpm5_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_tpm6_ipg_doze_MASK  (0x4000U)
#define CCM_GPR_SHARED10_m33_tpm6_ipg_doze_SHIFT (14U)
/*! m33_tpm6_ipg_doze - m33_tpm6_ipg_doze */
#define CCM_GPR_SHARED10_m33_tpm6_ipg_doze(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_tpm6_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_tpm6_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_gpt1_ipg_doze_MASK  (0x8000U)
#define CCM_GPR_SHARED10_m33_gpt1_ipg_doze_SHIFT (15U)
/*! m33_gpt1_ipg_doze - m33_gpt1_ipg_doze */
#define CCM_GPR_SHARED10_m33_gpt1_ipg_doze(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_gpt1_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_gpt1_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_gpt2_ipg_doze_MASK  (0x10000U)
#define CCM_GPR_SHARED10_m33_gpt2_ipg_doze_SHIFT (16U)
/*! m33_gpt2_ipg_doze - m33_gpt2_ipg_doze */
#define CCM_GPR_SHARED10_m33_gpt2_ipg_doze(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_gpt2_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_gpt2_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_can1_ipg_doze_MASK  (0x20000U)
#define CCM_GPR_SHARED10_m33_can1_ipg_doze_SHIFT (17U)
/*! m33_can1_ipg_doze - m33_can1_ipg_doze */
#define CCM_GPR_SHARED10_m33_can1_ipg_doze(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_can1_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_can1_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_can2_ipg_doze_MASK  (0x40000U)
#define CCM_GPR_SHARED10_m33_can2_ipg_doze_SHIFT (18U)
/*! m33_can2_ipg_doze - m33_can2_ipg_doze */
#define CCM_GPR_SHARED10_m33_can2_ipg_doze(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_can2_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_can2_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_can3_ipg_doze_MASK  (0x80000U)
#define CCM_GPR_SHARED10_m33_can3_ipg_doze_SHIFT (19U)
/*! m33_can3_ipg_doze - m33_can3_ipg_doze */
#define CCM_GPR_SHARED10_m33_can3_ipg_doze(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_can3_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_can3_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_lpuart1_ipg_doze_MASK (0x100000U)
#define CCM_GPR_SHARED10_m33_lpuart1_ipg_doze_SHIFT (20U)
/*! m33_lpuart1_ipg_doze - m33_lpuart1_ipg_doze */
#define CCM_GPR_SHARED10_m33_lpuart1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_lpuart1_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_lpuart1_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_lpuart2_ipg_doze_MASK (0x200000U)
#define CCM_GPR_SHARED10_m33_lpuart2_ipg_doze_SHIFT (21U)
/*! m33_lpuart2_ipg_doze - m33_lpuart2_ipg_doze */
#define CCM_GPR_SHARED10_m33_lpuart2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_lpuart2_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_lpuart2_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_lpuart3_ipg_doze_MASK (0x400000U)
#define CCM_GPR_SHARED10_m33_lpuart3_ipg_doze_SHIFT (22U)
/*! m33_lpuart3_ipg_doze - m33_lpuart3_ipg_doze */
#define CCM_GPR_SHARED10_m33_lpuart3_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_lpuart3_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_lpuart3_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_lpuart4_ipg_doze_MASK (0x800000U)
#define CCM_GPR_SHARED10_m33_lpuart4_ipg_doze_SHIFT (23U)
/*! m33_lpuart4_ipg_doze - m33_lpuart4_ipg_doze */
#define CCM_GPR_SHARED10_m33_lpuart4_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_lpuart4_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_lpuart4_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_lpuart5_ipg_doze_MASK (0x1000000U)
#define CCM_GPR_SHARED10_m33_lpuart5_ipg_doze_SHIFT (24U)
/*! m33_lpuart5_ipg_doze - m33_lpuart5_ipg_doze */
#define CCM_GPR_SHARED10_m33_lpuart5_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_lpuart5_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_lpuart5_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_lpuart6_ipg_doze_MASK (0x2000000U)
#define CCM_GPR_SHARED10_m33_lpuart6_ipg_doze_SHIFT (25U)
/*! m33_lpuart6_ipg_doze - m33_lpuart6_ipg_doze */
#define CCM_GPR_SHARED10_m33_lpuart6_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_lpuart6_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_lpuart6_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_lpuart7_ipg_doze_MASK (0x4000000U)
#define CCM_GPR_SHARED10_m33_lpuart7_ipg_doze_SHIFT (26U)
/*! m33_lpuart7_ipg_doze - m33_lpuart7_ipg_doze */
#define CCM_GPR_SHARED10_m33_lpuart7_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_lpuart7_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_lpuart7_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_lpuart8_ipg_doze_MASK (0x8000000U)
#define CCM_GPR_SHARED10_m33_lpuart8_ipg_doze_SHIFT (27U)
/*! m33_lpuart8_ipg_doze - m33_lpuart8_ipg_doze */
#define CCM_GPR_SHARED10_m33_lpuart8_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_lpuart8_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_lpuart8_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_lpuart9_ipg_doze_MASK (0x10000000U)
#define CCM_GPR_SHARED10_m33_lpuart9_ipg_doze_SHIFT (28U)
/*! m33_lpuart9_ipg_doze - m33_lpuart9_ipg_doze */
#define CCM_GPR_SHARED10_m33_lpuart9_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_lpuart9_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_lpuart9_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_lpuart10_ipg_doze_MASK (0x20000000U)
#define CCM_GPR_SHARED10_m33_lpuart10_ipg_doze_SHIFT (29U)
/*! m33_lpuart10_ipg_doze - m33_lpuart10_ipg_doze */
#define CCM_GPR_SHARED10_m33_lpuart10_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_lpuart10_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_lpuart10_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_lpuart11_ipg_doze_MASK (0x40000000U)
#define CCM_GPR_SHARED10_m33_lpuart11_ipg_doze_SHIFT (30U)
/*! m33_lpuart11_ipg_doze - m33_lpuart11_ipg_doze */
#define CCM_GPR_SHARED10_m33_lpuart11_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_lpuart11_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_lpuart11_ipg_doze_MASK)

#define CCM_GPR_SHARED10_m33_lpuart12_ipg_doze_MASK (0x80000000U)
#define CCM_GPR_SHARED10_m33_lpuart12_ipg_doze_SHIFT (31U)
/*! m33_lpuart12_ipg_doze - m33_lpuart12_ipg_doze */
#define CCM_GPR_SHARED10_m33_lpuart12_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_m33_lpuart12_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_m33_lpuart12_ipg_doze_MASK)
/*! @} */

/*! @name GPR_SHARED10_SET - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED10_SET_m33_adc1_ipg_doze_MASK (0x1U)
#define CCM_GPR_SHARED10_SET_m33_adc1_ipg_doze_SHIFT (0U)
/*! m33_adc1_ipg_doze - m33_adc1_ipg_doze */
#define CCM_GPR_SHARED10_SET_m33_adc1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED10_SET_m33_adc1_ipg_doze_SHIFT)) & CCM_GPR_SHARED10_SET_m33_adc1_ipg_doze_MASK)

