tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_CCM.h
#define CCM_GPR_SHARED13_m7_sai3_ipg_stop_MASK   (0x1000000U)
#define CCM_GPR_SHARED13_m7_sai3_ipg_stop_SHIFT  (24U)
/*! m7_sai3_ipg_stop - m7_sai3_ipg_stop */
#define CCM_GPR_SHARED13_m7_sai3_ipg_stop(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_m7_sai3_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_m7_sai3_ipg_stop_MASK)

#define CCM_GPR_SHARED13_m7_sai4_ipg_stop_MASK   (0x2000000U)
#define CCM_GPR_SHARED13_m7_sai4_ipg_stop_SHIFT  (25U)
/*! m7_sai4_ipg_stop - m7_sai4_ipg_stop */
#define CCM_GPR_SHARED13_m7_sai4_ipg_stop(x)     (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_m7_sai4_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_m7_sai4_ipg_stop_MASK)

#define CCM_GPR_SHARED13_m7_mic_ipg_stop_MASK    (0x4000000U)
#define CCM_GPR_SHARED13_m7_mic_ipg_stop_SHIFT   (26U)
/*! m7_mic_ipg_stop - m7_mic_ipg_stop */
#define CCM_GPR_SHARED13_m7_mic_ipg_stop(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_m7_mic_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_m7_mic_ipg_stop_MASK)
/*! @} */

/*! @name GPR_SHARED13_SET - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED13_SET_m7_lpuart6_ipg_stop_MASK (0x1U)
#define CCM_GPR_SHARED13_SET_m7_lpuart6_ipg_stop_SHIFT (0U)
/*! m7_lpuart6_ipg_stop - m7_lpuart6_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpuart6_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpuart6_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpuart6_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpuart7_ipg_stop_MASK (0x2U)
#define CCM_GPR_SHARED13_SET_m7_lpuart7_ipg_stop_SHIFT (1U)
/*! m7_lpuart7_ipg_stop - m7_lpuart7_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpuart7_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpuart7_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpuart7_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpuart8_ipg_stop_MASK (0x4U)
#define CCM_GPR_SHARED13_SET_m7_lpuart8_ipg_stop_SHIFT (2U)
/*! m7_lpuart8_ipg_stop - m7_lpuart8_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpuart8_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpuart8_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpuart8_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpuart9_ipg_stop_MASK (0x8U)
#define CCM_GPR_SHARED13_SET_m7_lpuart9_ipg_stop_SHIFT (3U)
/*! m7_lpuart9_ipg_stop - m7_lpuart9_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpuart9_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpuart9_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpuart9_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpuart10_ipg_stop_MASK (0x10U)
#define CCM_GPR_SHARED13_SET_m7_lpuart10_ipg_stop_SHIFT (4U)
/*! m7_lpuart10_ipg_stop - m7_lpuart10_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpuart10_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpuart10_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpuart10_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpuart11_ipg_stop_MASK (0x20U)
#define CCM_GPR_SHARED13_SET_m7_lpuart11_ipg_stop_SHIFT (5U)
/*! m7_lpuart11_ipg_stop - m7_lpuart11_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpuart11_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpuart11_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpuart11_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpuart12_ipg_stop_MASK (0x40U)
#define CCM_GPR_SHARED13_SET_m7_lpuart12_ipg_stop_SHIFT (6U)
/*! m7_lpuart12_ipg_stop - m7_lpuart12_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpuart12_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpuart12_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpuart12_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpi2c1_ipg_stop_MASK (0x80U)
#define CCM_GPR_SHARED13_SET_m7_lpi2c1_ipg_stop_SHIFT (7U)
/*! m7_lpi2c1_ipg_stop - m7_lpi2c1_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpi2c1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpi2c1_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpi2c1_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpi2c2_ipg_stop_MASK (0x100U)
#define CCM_GPR_SHARED13_SET_m7_lpi2c2_ipg_stop_SHIFT (8U)
/*! m7_lpi2c2_ipg_stop - m7_lpi2c2_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpi2c2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpi2c2_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpi2c2_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpi2c3_ipg_stop_MASK (0x200U)
#define CCM_GPR_SHARED13_SET_m7_lpi2c3_ipg_stop_SHIFT (9U)
/*! m7_lpi2c3_ipg_stop - m7_lpi2c3_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpi2c3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpi2c3_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpi2c3_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpi2c4_ipg_stop_MASK (0x400U)
#define CCM_GPR_SHARED13_SET_m7_lpi2c4_ipg_stop_SHIFT (10U)
/*! m7_lpi2c4_ipg_stop - m7_lpi2c4_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpi2c4_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpi2c4_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpi2c4_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpi2c5_ipg_stop_MASK (0x800U)
#define CCM_GPR_SHARED13_SET_m7_lpi2c5_ipg_stop_SHIFT (11U)
/*! m7_lpi2c5_ipg_stop - m7_lpi2c5_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpi2c5_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpi2c5_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpi2c5_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpi2c6_ipg_stop_MASK (0x1000U)
#define CCM_GPR_SHARED13_SET_m7_lpi2c6_ipg_stop_SHIFT (12U)
/*! m7_lpi2c6_ipg_stop - m7_lpi2c6_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpi2c6_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpi2c6_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpi2c6_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpspi1_ipg_stop_MASK (0x2000U)
#define CCM_GPR_SHARED13_SET_m7_lpspi1_ipg_stop_SHIFT (13U)
/*! m7_lpspi1_ipg_stop - m7_lpspi1_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpspi1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpspi1_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpspi1_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpspi2_ipg_stop_MASK (0x4000U)
#define CCM_GPR_SHARED13_SET_m7_lpspi2_ipg_stop_SHIFT (14U)
/*! m7_lpspi2_ipg_stop - m7_lpspi2_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpspi2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpspi2_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpspi2_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpspi3_ipg_stop_MASK (0x8000U)
#define CCM_GPR_SHARED13_SET_m7_lpspi3_ipg_stop_SHIFT (15U)
/*! m7_lpspi3_ipg_stop - m7_lpspi3_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpspi3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpspi3_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpspi3_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpspi4_ipg_stop_MASK (0x10000U)
#define CCM_GPR_SHARED13_SET_m7_lpspi4_ipg_stop_SHIFT (16U)
/*! m7_lpspi4_ipg_stop - m7_lpspi4_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpspi4_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpspi4_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpspi4_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpspi5_ipg_stop_MASK (0x20000U)
#define CCM_GPR_SHARED13_SET_m7_lpspi5_ipg_stop_SHIFT (17U)
/*! m7_lpspi5_ipg_stop - m7_lpspi5_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpspi5_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpspi5_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpspi5_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_lpspi6_ipg_stop_MASK (0x40000U)
#define CCM_GPR_SHARED13_SET_m7_lpspi6_ipg_stop_SHIFT (18U)
/*! m7_lpspi6_ipg_stop - m7_lpspi6_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_lpspi6_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_lpspi6_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_lpspi6_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_sinc1_ipg_stop_MASK (0x80000U)
#define CCM_GPR_SHARED13_SET_m7_sinc1_ipg_stop_SHIFT (19U)
/*! m7_sinc1_ipg_stop - m7_sinc1_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_sinc1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_sinc1_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_sinc1_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_sinc2_ipg_stop_MASK (0x100000U)
#define CCM_GPR_SHARED13_SET_m7_sinc2_ipg_stop_SHIFT (20U)
/*! m7_sinc2_ipg_stop - m7_sinc2_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_sinc2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_sinc2_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_sinc2_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_sinc3_ipg_stop_MASK (0x200000U)
#define CCM_GPR_SHARED13_SET_m7_sinc3_ipg_stop_SHIFT (21U)
/*! m7_sinc3_ipg_stop - m7_sinc3_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_sinc3_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_sinc3_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_sinc3_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_sai1_ipg_stop_MASK (0x400000U)
#define CCM_GPR_SHARED13_SET_m7_sai1_ipg_stop_SHIFT (22U)
/*! m7_sai1_ipg_stop - m7_sai1_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_sai1_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_sai1_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_sai1_ipg_stop_MASK)

#define CCM_GPR_SHARED13_SET_m7_sai2_ipg_stop_MASK (0x800000U)
#define CCM_GPR_SHARED13_SET_m7_sai2_ipg_stop_SHIFT (23U)
/*! m7_sai2_ipg_stop - m7_sai2_ipg_stop */
#define CCM_GPR_SHARED13_SET_m7_sai2_ipg_stop(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED13_SET_m7_sai2_ipg_stop_SHIFT)) & CCM_GPR_SHARED13_SET_m7_sai2_ipg_stop_MASK)

