tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_CCM.h
#define CCM_GPR_SHARED14_m7_lpuart9_ipg_doze_MASK (0x10000000U)
#define CCM_GPR_SHARED14_m7_lpuart9_ipg_doze_SHIFT (28U)
/*! m7_lpuart9_ipg_doze - m7_lpuart9_ipg_doze */
#define CCM_GPR_SHARED14_m7_lpuart9_ipg_doze(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_m7_lpuart9_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_m7_lpuart9_ipg_doze_MASK)

#define CCM_GPR_SHARED14_m7_lpuart10_ipg_doze_MASK (0x20000000U)
#define CCM_GPR_SHARED14_m7_lpuart10_ipg_doze_SHIFT (29U)
/*! m7_lpuart10_ipg_doze - m7_lpuart10_ipg_doze */
#define CCM_GPR_SHARED14_m7_lpuart10_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_m7_lpuart10_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_m7_lpuart10_ipg_doze_MASK)

#define CCM_GPR_SHARED14_m7_lpuart11_ipg_doze_MASK (0x40000000U)
#define CCM_GPR_SHARED14_m7_lpuart11_ipg_doze_SHIFT (30U)
/*! m7_lpuart11_ipg_doze - m7_lpuart11_ipg_doze */
#define CCM_GPR_SHARED14_m7_lpuart11_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_m7_lpuart11_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_m7_lpuart11_ipg_doze_MASK)

#define CCM_GPR_SHARED14_m7_lpuart12_ipg_doze_MASK (0x80000000U)
#define CCM_GPR_SHARED14_m7_lpuart12_ipg_doze_SHIFT (31U)
/*! m7_lpuart12_ipg_doze - m7_lpuart12_ipg_doze */
#define CCM_GPR_SHARED14_m7_lpuart12_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_m7_lpuart12_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_m7_lpuart12_ipg_doze_MASK)
/*! @} */

/*! @name GPR_SHARED14_SET - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED14_SET_m7_adc1_ipg_doze_MASK (0x1U)
#define CCM_GPR_SHARED14_SET_m7_adc1_ipg_doze_SHIFT (0U)
/*! m7_adc1_ipg_doze - m7_adc1_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_adc1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_adc1_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_adc1_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_adc2_ipg_doze_MASK (0x2U)
#define CCM_GPR_SHARED14_SET_m7_adc2_ipg_doze_SHIFT (1U)
/*! m7_adc2_ipg_doze - m7_adc2_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_adc2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_adc2_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_adc2_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_flexspi1_ipg_doze_MASK (0x4U)
#define CCM_GPR_SHARED14_SET_m7_flexspi1_ipg_doze_SHIFT (2U)
/*! m7_flexspi1_ipg_doze - m7_flexspi1_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_flexspi1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_flexspi1_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_flexspi1_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_flexspi2_ipg_doze_MASK (0x8U)
#define CCM_GPR_SHARED14_SET_m7_flexspi2_ipg_doze_SHIFT (3U)
/*! m7_flexspi2_ipg_doze - m7_flexspi2_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_flexspi2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_flexspi2_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_flexspi2_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_flexio1_ipg_doze_MASK (0x10U)
#define CCM_GPR_SHARED14_SET_m7_flexio1_ipg_doze_SHIFT (4U)
/*! m7_flexio1_ipg_doze - m7_flexio1_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_flexio1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_flexio1_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_flexio1_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_flexio2_ipg_doze_MASK (0x20U)
#define CCM_GPR_SHARED14_SET_m7_flexio2_ipg_doze_SHIFT (5U)
/*! m7_flexio2_ipg_doze - m7_flexio2_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_flexio2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_flexio2_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_flexio2_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_lpit1_ipg_doze_MASK (0x40U)
#define CCM_GPR_SHARED14_SET_m7_lpit1_ipg_doze_SHIFT (6U)
/*! m7_lpit1_ipg_doze - m7_lpit1_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_lpit1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_lpit1_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_lpit1_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_lpit2_ipg_doze_MASK (0x80U)
#define CCM_GPR_SHARED14_SET_m7_lpit2_ipg_doze_SHIFT (7U)
/*! m7_lpit2_ipg_doze - m7_lpit2_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_lpit2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_lpit2_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_lpit2_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_lpit3_ipg_doze_MASK (0x100U)
#define CCM_GPR_SHARED14_SET_m7_lpit3_ipg_doze_SHIFT (8U)
/*! m7_lpit3_ipg_doze - m7_lpit3_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_lpit3_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_lpit3_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_lpit3_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_tpm1_ipg_doze_MASK (0x200U)
#define CCM_GPR_SHARED14_SET_m7_tpm1_ipg_doze_SHIFT (9U)
/*! m7_tpm1_ipg_doze - m7_tpm1_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_tpm1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_tpm1_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_tpm1_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_tpm2_ipg_doze_MASK (0x400U)
#define CCM_GPR_SHARED14_SET_m7_tpm2_ipg_doze_SHIFT (10U)
/*! m7_tpm2_ipg_doze - m7_tpm2_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_tpm2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_tpm2_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_tpm2_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_tpm3_ipg_doze_MASK (0x800U)
#define CCM_GPR_SHARED14_SET_m7_tpm3_ipg_doze_SHIFT (11U)
/*! m7_tpm3_ipg_doze - m7_tpm3_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_tpm3_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_tpm3_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_tpm3_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_tpm4_ipg_doze_MASK (0x1000U)
#define CCM_GPR_SHARED14_SET_m7_tpm4_ipg_doze_SHIFT (12U)
/*! m7_tpm4_ipg_doze - m7_tpm4_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_tpm4_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_tpm4_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_tpm4_ipg_doze_MASK)

#define CCM_GPR_SHARED14_SET_m7_tpm5_ipg_doze_MASK (0x2000U)
#define CCM_GPR_SHARED14_SET_m7_tpm5_ipg_doze_SHIFT (13U)
/*! m7_tpm5_ipg_doze - m7_tpm5_ipg_doze */
#define CCM_GPR_SHARED14_SET_m7_tpm5_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED14_SET_m7_tpm5_ipg_doze_SHIFT)) & CCM_GPR_SHARED14_SET_m7_tpm5_ipg_doze_MASK)

