tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_CCM.h
#define CCM_GPR_SHARED15_m7_sinc2_ipg_doze_MASK  (0x2000U)
#define CCM_GPR_SHARED15_m7_sinc2_ipg_doze_SHIFT (13U)
/*! m7_sinc2_ipg_doze - m7_sinc2_ipg_doze */
#define CCM_GPR_SHARED15_m7_sinc2_ipg_doze(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_m7_sinc2_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_m7_sinc2_ipg_doze_MASK)

#define CCM_GPR_SHARED15_m7_sinc3_ipg_doze_MASK  (0x4000U)
#define CCM_GPR_SHARED15_m7_sinc3_ipg_doze_SHIFT (14U)
/*! m7_sinc3_ipg_doze - m7_sinc3_ipg_doze */
#define CCM_GPR_SHARED15_m7_sinc3_ipg_doze(x)    (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_m7_sinc3_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_m7_sinc3_ipg_doze_MASK)

#define CCM_GPR_SHARED15_m7_mic_ipg_doze_MASK    (0x8000U)
#define CCM_GPR_SHARED15_m7_mic_ipg_doze_SHIFT   (15U)
/*! m7_mic_ipg_doze - m7_mic_ipg_doze */
#define CCM_GPR_SHARED15_m7_mic_ipg_doze(x)      (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_m7_mic_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_m7_mic_ipg_doze_MASK)
/*! @} */

/*! @name GPR_SHARED15_SET - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED15_SET_m7_lpi2c1_ipg_doze_MASK (0x1U)
#define CCM_GPR_SHARED15_SET_m7_lpi2c1_ipg_doze_SHIFT (0U)
/*! m7_lpi2c1_ipg_doze - m7_lpi2c1_ipg_doze */
#define CCM_GPR_SHARED15_SET_m7_lpi2c1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_SET_m7_lpi2c1_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_SET_m7_lpi2c1_ipg_doze_MASK)

#define CCM_GPR_SHARED15_SET_m7_lpi2c2_ipg_doze_MASK (0x2U)
#define CCM_GPR_SHARED15_SET_m7_lpi2c2_ipg_doze_SHIFT (1U)
/*! m7_lpi2c2_ipg_doze - m7_lpi2c2_ipg_doze */
#define CCM_GPR_SHARED15_SET_m7_lpi2c2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_SET_m7_lpi2c2_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_SET_m7_lpi2c2_ipg_doze_MASK)

#define CCM_GPR_SHARED15_SET_m7_lpi2c3_ipg_doze_MASK (0x4U)
#define CCM_GPR_SHARED15_SET_m7_lpi2c3_ipg_doze_SHIFT (2U)
/*! m7_lpi2c3_ipg_doze - m7_lpi2c3_ipg_doze */
#define CCM_GPR_SHARED15_SET_m7_lpi2c3_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_SET_m7_lpi2c3_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_SET_m7_lpi2c3_ipg_doze_MASK)

#define CCM_GPR_SHARED15_SET_m7_lpi2c4_ipg_doze_MASK (0x8U)
#define CCM_GPR_SHARED15_SET_m7_lpi2c4_ipg_doze_SHIFT (3U)
/*! m7_lpi2c4_ipg_doze - m7_lpi2c4_ipg_doze */
#define CCM_GPR_SHARED15_SET_m7_lpi2c4_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_SET_m7_lpi2c4_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_SET_m7_lpi2c4_ipg_doze_MASK)

#define CCM_GPR_SHARED15_SET_m7_lpi2c5_ipg_doze_MASK (0x10U)
#define CCM_GPR_SHARED15_SET_m7_lpi2c5_ipg_doze_SHIFT (4U)
/*! m7_lpi2c5_ipg_doze - m7_lpi2c5_ipg_doze */
#define CCM_GPR_SHARED15_SET_m7_lpi2c5_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_SET_m7_lpi2c5_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_SET_m7_lpi2c5_ipg_doze_MASK)

#define CCM_GPR_SHARED15_SET_m7_lpi2c6_ipg_doze_MASK (0x20U)
#define CCM_GPR_SHARED15_SET_m7_lpi2c6_ipg_doze_SHIFT (5U)
/*! m7_lpi2c6_ipg_doze - m7_lpi2c6_ipg_doze */
#define CCM_GPR_SHARED15_SET_m7_lpi2c6_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_SET_m7_lpi2c6_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_SET_m7_lpi2c6_ipg_doze_MASK)

#define CCM_GPR_SHARED15_SET_m7_lpspi1_ipg_doze_MASK (0x40U)
#define CCM_GPR_SHARED15_SET_m7_lpspi1_ipg_doze_SHIFT (6U)
/*! m7_lpspi1_ipg_doze - m7_lpspi1_ipg_doze */
#define CCM_GPR_SHARED15_SET_m7_lpspi1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_SET_m7_lpspi1_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_SET_m7_lpspi1_ipg_doze_MASK)

#define CCM_GPR_SHARED15_SET_m7_lpspi2_ipg_doze_MASK (0x80U)
#define CCM_GPR_SHARED15_SET_m7_lpspi2_ipg_doze_SHIFT (7U)
/*! m7_lpspi2_ipg_doze - m7_lpspi2_ipg_doze */
#define CCM_GPR_SHARED15_SET_m7_lpspi2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_SET_m7_lpspi2_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_SET_m7_lpspi2_ipg_doze_MASK)

#define CCM_GPR_SHARED15_SET_m7_lpspi3_ipg_doze_MASK (0x100U)
#define CCM_GPR_SHARED15_SET_m7_lpspi3_ipg_doze_SHIFT (8U)
/*! m7_lpspi3_ipg_doze - m7_lpspi3_ipg_doze */
#define CCM_GPR_SHARED15_SET_m7_lpspi3_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_SET_m7_lpspi3_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_SET_m7_lpspi3_ipg_doze_MASK)

#define CCM_GPR_SHARED15_SET_m7_lpspi4_ipg_doze_MASK (0x200U)
#define CCM_GPR_SHARED15_SET_m7_lpspi4_ipg_doze_SHIFT (9U)
/*! m7_lpspi4_ipg_doze - m7_lpspi4_ipg_doze */
#define CCM_GPR_SHARED15_SET_m7_lpspi4_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_SET_m7_lpspi4_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_SET_m7_lpspi4_ipg_doze_MASK)

#define CCM_GPR_SHARED15_SET_m7_lpspi5_ipg_doze_MASK (0x400U)
#define CCM_GPR_SHARED15_SET_m7_lpspi5_ipg_doze_SHIFT (10U)
/*! m7_lpspi5_ipg_doze - m7_lpspi5_ipg_doze */
#define CCM_GPR_SHARED15_SET_m7_lpspi5_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_SET_m7_lpspi5_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_SET_m7_lpspi5_ipg_doze_MASK)

#define CCM_GPR_SHARED15_SET_m7_lpspi6_ipg_doze_MASK (0x800U)
#define CCM_GPR_SHARED15_SET_m7_lpspi6_ipg_doze_SHIFT (11U)
/*! m7_lpspi6_ipg_doze - m7_lpspi6_ipg_doze */
#define CCM_GPR_SHARED15_SET_m7_lpspi6_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_SET_m7_lpspi6_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_SET_m7_lpspi6_ipg_doze_MASK)

#define CCM_GPR_SHARED15_SET_m7_sinc1_ipg_doze_MASK (0x1000U)
#define CCM_GPR_SHARED15_SET_m7_sinc1_ipg_doze_SHIFT (12U)
/*! m7_sinc1_ipg_doze - m7_sinc1_ipg_doze */
#define CCM_GPR_SHARED15_SET_m7_sinc1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_SET_m7_sinc1_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_SET_m7_sinc1_ipg_doze_MASK)

#define CCM_GPR_SHARED15_SET_m7_sinc2_ipg_doze_MASK (0x2000U)
#define CCM_GPR_SHARED15_SET_m7_sinc2_ipg_doze_SHIFT (13U)
/*! m7_sinc2_ipg_doze - m7_sinc2_ipg_doze */
#define CCM_GPR_SHARED15_SET_m7_sinc2_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_SET_m7_sinc2_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_SET_m7_sinc2_ipg_doze_MASK)

#define CCM_GPR_SHARED15_SET_m7_sinc3_ipg_doze_MASK (0x4000U)
#define CCM_GPR_SHARED15_SET_m7_sinc3_ipg_doze_SHIFT (14U)
/*! m7_sinc3_ipg_doze - m7_sinc3_ipg_doze */
#define CCM_GPR_SHARED15_SET_m7_sinc3_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_SET_m7_sinc3_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_SET_m7_sinc3_ipg_doze_MASK)

#define CCM_GPR_SHARED15_SET_m7_mic_ipg_doze_MASK (0x8000U)
#define CCM_GPR_SHARED15_SET_m7_mic_ipg_doze_SHIFT (15U)
/*! m7_mic_ipg_doze - m7_mic_ipg_doze */
#define CCM_GPR_SHARED15_SET_m7_mic_ipg_doze(x)  (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_SET_m7_mic_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_SET_m7_mic_ipg_doze_MASK)
/*! @} */

/*! @name GPR_SHARED15_CLR - General Purpose Register */
/*! @{ */

#define CCM_GPR_SHARED15_CLR_m7_lpi2c1_ipg_doze_MASK (0x1U)
#define CCM_GPR_SHARED15_CLR_m7_lpi2c1_ipg_doze_SHIFT (0U)
/*! m7_lpi2c1_ipg_doze - m7_lpi2c1_ipg_doze */
#define CCM_GPR_SHARED15_CLR_m7_lpi2c1_ipg_doze(x) (((uint32_t)(((uint32_t)(x)) << CCM_GPR_SHARED15_CLR_m7_lpi2c1_ipg_doze_SHIFT)) & CCM_GPR_SHARED15_CLR_m7_lpi2c1_ipg_doze_MASK)

